import { Buffer } from 'buffer'
import BN from 'bn.js'
import Decimal from 'decimal.js'
// @ts-ignore
import abcCopy from 'abc-copy'
import dayjs, { Dayjs } from 'dayjs'
import GraphemeSplitter from 'grapheme-splitter'
import { SignTypedDataVersion, TypedMessage, TypedDataUtils } from '@metamask/eth-sig-util'
import Das from 'das-sdk'
// @ts-ignore
import blake2b from 'blake2b'
import { ACCOUNT_SUFFIX, CHAR_TYPE, TIME_FORMAT, TOKEN_DECIMAL_PLACES } from '~/constant'
import { CKB } from '~/constant/chain'

/**
 * Used to determine whether it is a mobile terminal
 */
export function isMobile (): boolean {
  return window.innerWidth < 960
}

/**
 * Enhance the key of the module in vuex, because these modules have namespace, so the outside world must add namespace if they want to use it.
 * @param keys
 * @param namespace
 */
export function augmentKeys<T> (keys: T, namespace: string): T {
  const ret: any = {}
  for (const key in keys) {
    if (!Object.prototype.hasOwnProperty.call(keys, key)) {
      continue
    }

    if (key === 'namespace') {
      ret[key] = keys[key]
    }
    else {
      ret[key] = `${namespace}/${keys[key]}`
    }
  }
  return ret
}

/**
 * shrinkUnit
 * @param value
 * @param shrinkDecimals
 * @param precision
 */
export function shrinkUnit (value: string|number|Decimal, shrinkDecimals: number, precision = 8): string {
  value = value || 0
  const decimalNum = Decimal.div(value, 10 ** shrinkDecimals)
  let decimals = decimalNum.decimalPlaces()

  if (decimals > precision) {
    decimals = precision
  }
  return decimalNum.toFixed(decimals, Decimal.ROUND_DOWN)
}

/**
 * expandUnit
 * @param value
 * @param decimals
 * @param precision
 */
export function expandUnit (value: string|number|Decimal, decimals: number, precision = 0): string {
  value = value || 0
  return Decimal.mul(value, 10 ** decimals).toFixed(precision, Decimal.ROUND_DOWN)
}

/**
 * Thousands of divisions
 * @param num
 * @param digits
 */
export function thousandSplit (num: number | string | Decimal, digits?: number): string {
  if (digits && digits > 0) {
    if (Decimal.isDecimal(num)) {
      num = (num as Decimal).toFixed(digits).toString()
    }
    else {
      num = new Decimal(num).toFixed(digits).toString()
    }
  }
  const strNum = num + ''
  if (strNum.includes('.')) {
    return (num + '').replace(/(\d)(?=(\d{3})+\.)/g, '$1,')
  }
  else {
    return strNum.replace(/(\d)(?=(?:\d{3})+$)/g, '$1,')
  }
}

/**
 * Copy data to the clipboard
 * @param text
 * @param el
 */
export function copyText (text: string, el?: Element): Promise<void> {
  return abcCopy(text, {
    target: el
  })
}

/**
 * String reduction
 * @param inputString
 * @param head
 * @param tail
 * @param tokenStr
 */
export function collapseString (inputString = '', head = 4, tail = 4, tokenStr = '...'): string {
  const splitter = new GraphemeSplitter()
  const split = splitter.splitGraphemes(inputString)
  if (inputString.length > 12) {
    return split.slice(0, head).join('') + tokenStr + split.slice(split.length - tail, split.length).join('')
  }
  else {
    return inputString
  }
}

/**
 * Handling dayjs format not supported in safari 2019-07-02T13:34:11+0000
 * @param timestamp
 */
export function safariTimestampFormat (timestamp: string | number | Dayjs): string | number | Dayjs {
  if (typeof timestamp === 'string') {
    return timestamp.replace(/\+0000/, 'Z')
  }
  else {
    return timestamp
  }
}

/**
 * Convert the time to the specified time format
 * @param timestamp
 * @param template
 */
export function formatDateTime (timestamp: string | number | Dayjs, template = TIME_FORMAT.fullDateTime): string {
  timestamp = safariTimestampFormat(timestamp)
  return dayjs(timestamp).format(template)
}

export interface ICharInfo {
  char_set_name: number,
  char: string
}

const emojiList = ['🎱', '💯', '🔢', '👍', '👎', '🆎', '🧮', '🔤', '🔡', '🧑', '🚡', '🛬', '🛫', '⏰', '👽', '🚑', '🏺', '⚓', '👼', '💢', '😠', '😧', '🐜', '🍎', '♒', '🏹', '♈', '⏬', '⏫', '🔽', '🔼', '🔃', '🔄', '🎨', '🚛', '😲', '👟', '🏧', '🥑', '👶', '🍼', '🐤', '🚼', '🔙', '🤚', '🥓', '🦡', '🏸', '🥯', '🛄', '🥖', '🎈', '🎍', '🍌', '🏦', '📊', '💈', '⚾', '🧺', '🏀', '🦇', '🛀', '🛁', '🔋', '🐻', '🧔', '🐝', '🍺', '🍻', '🐞', '🔰', '🔔', '🍱', '🚴', '🚲', '👙', '🧢', '🐦', '🎂', '⚫', '🖤', '🃏', '⬛', '◾', '🔲', '👱', '🌼', '🐡', '📘', '🚙', '🔵', '💙', '😊', '🐗', '💣', '🦴', '📖', '🔖', '📑', '📚', '💥', '👢', '🍾', '💐', '🙇', '🥣', '🎳', '🥊', '👦', '🧠', '🍞', '🤱', '🧱', '👰', '🌉', '💼', '🥦', '💔', '🧹', '🐛', '💡', '🚅', '🚄', '🌯', '🚌', '🚏', '👤', '👥', '🦋', '🌵', '🍰', '📆', '🤙', '📲', '🐫', '📷', '📸', '♋', '🍬', '🥫', '🛶', '🔠', '♑', '📇', '🎠', '🥕', '🤸', '🐱', '🐈', '💿', '🥂', '💹', '📉', '📈', '🏁', '🧀', '🍒', '🌸', '🌰', '🐔', '🧒', '🚸', '🍫', '🥢', '🎄', '⛪', '🎦', '🎪', '🌆', '🌇', '🆑', '👏', '🎬', '📋', '🕐', '🕑', '🕒', '🕓', '🕔', '🕕', '🕖', '🕗', '🕘', '🕙', '🕚', '🕛', '🕜', '🕝', '🕞', '🕟', '🕠', '🕡', '🕢', '🕣', '🕤', '🕥', '🕦', '🕧', '📕', '🔐', '🌂', '🤡', '🧥', '🍸', '🥥', '☕', '🥶', '😰', '🧭', '💻', '🎊', '😖', '😕', '🚧', '👷', '🏪', '🍪', '🍳', '🆒', '👮', '🌽', '👫', '💑', '💏', '🐮', '🐄', '🤠', '🦀', '💳', '🌙', '🦗', '🏏', '🐊', '🥐', '🎌', '👑', '😢', '😿', '🔮', '🥒', '🥤', '🧁', '💘', '🥌', '➰', '💱', '🍛', '🍮', '🛃', '🥩', '🌀', '💃', '👯', '🍡', '🎯', '💨', '📅', '🌳', '🦌', '🏬', '💠', '😞', '😥', '💫', '😵', '🧬', '🚯', '🐶', '🐕', '💵', '🎎', '🐬', '🚪', '🍩', '🐉', '🐲', '👗', '🐪', '🤤', '💧', '🥁', '🦆', '🥟', '📀', '📧', '🦅', '👂', '🌾', '🌍', '🌎', '🌏', '🥚', '🍆', '🔌', '🐘', '🧝', '🔚', '📩', '💶', '🏰', '🏤', '🌲', '❗', '🤰', '🤯', '😑', '👓', '👀', '🤦', '🤮', '🤭', '🤕', '🧐', '🤨', '🙄', '🤬', '🤒', '🏭', '🧚', '🍂', '👪', '⏩', '📠', '😨', '🐾', '🤺', '🎡', '🏑', '📁', '🤞', '🔥', '🚒', '🧯', '🧨', '🎆', '🥇', '🌓', '🌛', '🐟', '🍥', '🎣', '✊', '🎏', '🔦', '💾', '🎴', '😳', '🥏', '🛸', '🌁', '🦶', '🏈', '👣', '🍴', '🥠', '⛲', '🍀', '🦊', '🆓', '🍤', '🍟', '🐸', '😦', '⛽', '🌕', '🌝', '🎲', '💎', '♊', '🧞', '👻', '🎁', '💝', '🦒', '👧', '🥛', '🌐', '🧤', '🥅', '🐐', '🥽', '⛳', '🦍', '👵', '🍇', '🍏', '📗', '💚', '🥗', '❕', '❔', '😬', '😁', '😀', '💂', '🎸', '🔫', '💇', '🍔', '🔨', '🐹', '👜', '🤾', '🤝', '💩', '🐥', '🐣', '🎧', '🙉', '💟', '😍', '😻', '💓', '💗', '➗', '💲', '➖', '➕', '🦔', '🚁', '🌿', '🌺', '🔆', '👠', '🥾', '🦛', '🏒', '🍯', '🐴', '🏇', '🏥', '🌭', '🥵', '🏨', '⌛', '⏳', '🏠', '🏡', '🤗', '😯', '🍨', '🍦', '🆔', '👿', '📥', '📨', '💁', '😇', '📱', '🏮', '🎃', '🗾', '🏯', '👺', '👹', '👖', '🧩', '😂', '😹', '🤹', '🕋', '🦘', '🥋', '🔑', '🔟', '👘', '💋', '😗', '😽', '😚', '😘', '😙', '🥝', '🔪', '🐨', '🥼', '🥍', '🔷', '🔶', '🌗', '🌜', '😆', '🥬', '🍃', '📒', '🤛', '🛅', '🦵', '🍋', '♌', '🐆', '🤥', '♎', '🚈', '🔗', '🦁', '👄', '💄', '🦎', '🦙', '🦞', '🔒', '🔏', '🍭', '➿', '🔊', '📢', '🏩', '💌', '🤟', '🔅', '🧳', '🔍', '🔎', '🧙', '🧲', '🀄', '📫', '📪', '📬', '📭', '🕺', '👨', '🤵', '👲', '👳', '🥭', '👞', '🍁', '😷', '💆', '🍖', '🏅', '📣', '🍈', '📝', '🕎', '🚹', '🧜', '🤘', '🚇', '🦠', '🎤', '🔬', '🖕', '🌌', '🚐', '💽', '📴', '🤑', '💸', '💰', '🐒', '🐵', '🚝', '🥮', '🎓', '🕌', '🦟', '🤶', '🛵', '🗻', '🚵', '🚠', '🚞', '🐭', '🐁', '🎥', '🗿', '💪', '🍄', '🎹', '🎵', '🎼', '🔇', '💅', '📛', '🤢', '🧿', '👔', '❎', '🤓', '😐', '🆕', '🌑', '🌚', '📰', '🆖', '🌃', '🔕', '🚳', '⛔', '🚫', '🙅', '📵', '😶', '🚷', '🚭', '🚱', '👃', '📓', '📔', '🎶', '🔩', '⭕', '🌊', '🛑', '🐙', '🍢', '🏢', '🆗', '👌', '🙆', '🧓', '👴', '🔛', '🚘', '🚍', '🚔', '🚖', '📂', '👐', '😮', '⛎', '📙', '🧡', '📤', '🦉', '🐂', '📦', '🥘', '📄', '📃', '📟', '🌴', '🤲', '🥞', '🐼', '📎', '🦜', '⛅', '🥳', '🛂', '🍑', '🦚', '🥜', '🍐', '🐧', '😔', '🤼', '🎭', '😣', '🧗', '🙍', '🧘', '🧖', '🤽', '🙎', '🙋', '🚣', '🏃', '🤷', '🏄', '🏊', '🚶', '🧫', '🥧', '🐷', '🐖', '🐽', '💊', '🍍', '🏓', '♓', '🍕', '🛐', '🥺', '👇', '👈', '👉', '👆', '🚓', '🐩', '🍿', '🏣', '📯', '📮', '🚰', '🥔', '👝', '🍗', '💷', '😾', '🙏', '📿', '🥨', '🤴', '👸', '👊', '💜', '👛', '📌', '🚮', '❓', '🐰', '🐇', '🦝', '🐎', '📻', '🔘', '😡', '🚃', '🌈', '✋', '🖖', '🙌', '🐏', '🍜', '🐀', '🧾', '🚗', '🔴', '🧧', '😌', '🔁', '🔂', '🚻', '💞', '⏪', '🦏', '🎀', '🍚', '🍙', '🍘', '🎑', '🤜', '💍', '🤖', '🚀', '🤣', '🧻', '🎢', '🐓', '🌹', '🚨', '📍', '🏉', '🎽', '🧷', '♐', '⛵', '🍶', '🧂', '👡', '🥪', '🎅', '📡', '🦕', '🎷', '🧣', '🏫', '🎒', '🛴', '🦂', '♏', '😱', '🙀', '📜', '💺', '🥈', '🙈', '🌱', '🤳', '🦈', '🍧', '🐑', '🐚', '🚢', '👕', '🛒', '🚿', '🦐', '🤫', '📶', '🔯', '🛹', '💀', '🎿', '🛷', '😴', '🛌', '😪', '🙁', '🙂', '🎰', '🔹', '🔸', '🔺', '🔻', '😄', '😸', '😃', '😺', '🥰', '😈', '😏', '😼', '🚬', '🐌', '🐍', '🤧', '🏂', '⛄', '🧼', '😭', '⚽', '🧦', '🥎', '🔜', '🆘', '🔉', '👾', '🍝', '🎇', '✨', '💖', '🙊', '🔈', '💬', '🚤', '🧽', '🥄', '🧴', '🦑', '⭐', '🌟', '🤩', '🌠', '🚉', '🗽', '🚂', '🍲', '📏', '🍓', '😛', '😝', '😜', '🥙', '🌞', '🌻', '😎', '🌅', '🌄', '🦸', '🦹', '🍣', '🚟', '🦢', '😓', '💦', '😅', '🍠', '🔣', '🕍', '💉', '🦖', '🌮', '🎉', '🥡', '🎋', '🍊', '♉', '🚕', '🍵', '🧸', '📞', '🔭', '🎾', '⛺', '🧪', '🤔', '🥉', '💭', '🧵', '🎫', '🐯', '🐅', '😫', '🚽', '🗼', '🍅', '👅', '🧰', '🦷', '🔝', '🎩', '🚜', '🚥', '🚋', '🚆', '🚊', '🚩', '📐', '🔱', '😤', '🚎', '🏆', '🍹', '🐠', '🚚', '🎺', '🌷', '🥃', '🦃', '🐢', '📺', '🔀', '💕', '👬', '👭', '☔', '😒', '🔞', '🦄', '🔓', '🆙', '🙃', '🧛', '🚦', '📼', '📳', '📹', '🎮', '🎻', '♍', '🌋', '🏐', '🆚', '🌘', '🌖', '⌚', '🐃', '🍉', '👋', '🌒', '🌔', '🚾', '😩', '💒', '🐳', '🐋', '♿', '✅', '⚪', '💮', '⬜', '◽', '🔳', '🥀', '🎐', '🍷', '😉', '🐺', '👩', '🧕', '👚', '🥿', '👒', '🚺', '🥴', '😟', '🔧', '❌', '🧶', '💛', '💴', '😋', '🤪', '⚡', '🦓', '🤐', '🧟', '💤']
const numberList = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '-']
const englishList = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', '.']
// const japaneseList = ['ぁ', 'あ', 'ぃ', 'い', 'ぅ', 'う', 'ぇ', 'え', 'ぉ', 'お', 'か', 'が', 'き', 'ぎ', 'く', 'ぐ', 'け', 'げ', 'こ', 'ご', 'さ', 'ざ', 'し', 'じ', 'す', 'ず', 'せ', 'ぜ', 'そ', 'ぞ', 'た', 'だ', 'ち', 'ぢ', 'っ', 'つ', 'づ', 'て', 'で', 'と', 'ど', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ば', 'ぱ', 'ひ', 'び', 'ぴ', 'ふ', 'ぶ', 'ぷ', 'へ', 'べ', 'ぺ', 'ほ', 'ぼ', 'ぽ', 'ま', 'み', 'む', 'め', 'も', 'ゃ', 'や', 'ゅ', 'ゆ', 'ょ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'ゎ', 'わ', 'ゐ', 'ゑ', 'を', 'ん', 'ゔ', 'ゕ', 'ゖ', 'ゝ', 'ゞ', '゠', 'ァ', 'ア', 'ィ', 'イ', 'ゥ', 'ウ', 'ェ', 'エ', 'ォ', 'オ', 'カ', 'ガ', 'キ', 'ギ', 'ク', 'グ', 'ケ', 'ゲ', 'コ', 'ゴ', 'サ', 'ザ', 'シ', 'ジ', 'ス', 'ズ', 'セ', 'ゼ', 'ソ', 'ゾ', 'タ', 'ダ', 'チ', 'ヂ', 'ッ', 'ツ', 'ヅ', 'テ', 'デ', 'ト', 'ド', 'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ハ', 'バ', 'パ', 'ヒ', 'ビ', 'ピ', 'フ', 'ブ', 'プ', 'ヘ', 'ベ', 'ペ', 'ホ', 'ボ', 'ポ', 'マ', 'ミ', 'ム', 'メ', 'モ', 'ャ', 'ヤ', 'ュ', 'ユ', 'ョ', 'ヨ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ヮ', 'ワ', 'ヰ', 'ヱ', 'ヲ', 'ン', 'ヴ', 'ヵ', 'ヶ', 'ヷ', 'ヸ', 'ヹ', 'ヺ', '・', 'ー', 'ヽ', 'ヾ', '亜', '哀', '挨', '愛', '曖', '悪', '握', '圧', '扱', '宛', '嵐', '安', '案', '暗', '以', '衣', '位', '囲', '医', '依', '委', '威', '為', '畏', '胃', '尉', '異', '移', '萎', '偉', '椅', '彙', '意', '違', '維', '慰', '遺', '緯', '域', '育', '一', '壱', '逸', '茨', '芋', '引', '印', '因', '咽', '姻', '員', '院', '淫', '陰', '飲', '隠', '韻', '右', '宇', '羽', '雨', '唄', '鬱', '畝', '浦', '運', '雲', '永', '泳', '英', '映', '栄', '営', '詠', '影', '鋭', '衛', '易', '疫', '益', '液', '駅', '悦', '越', '謁', '閲', '円', '延', '沿', '炎', '怨', '宴', '媛', '援', '園', '煙', '猿', '遠', '鉛', '塩', '演', '縁', '艶', '汚', '王', '凹', '央', '応', '往', '押', '旺', '欧', '殴', '桜', '翁', '奥', '横', '岡', '屋', '億', '憶', '臆', '虞', '乙', '俺', '卸', '音', '恩', '温', '穏', '下', '化', '火', '加', '可', '仮', '何', '花', '佳', '価', '果', '河', '苛', '科', '架', '夏', '家', '荷', '華', '菓', '貨', '渦', '過', '嫁', '暇', '禍', '靴', '寡', '歌', '箇', '稼', '課', '蚊', '牙', '瓦', '我', '画', '芽', '賀', '雅', '餓', '介', '回', '灰', '会', '快', '戒', '改', '怪', '拐', '悔', '海', '界', '皆', '械', '絵', '開', '階', '塊', '楷', '解', '潰', '壊', '懐', '諧', '貝', '外', '劾', '害', '崖', '涯', '街', '慨', '蓋', '該', '概', '骸', '垣', '柿', '各', '角', '拡', '革', '格', '核', '殻', '郭', '覚', '較', '隔', '閣', '確', '獲', '嚇', '穫', '学', '岳', '楽', '額', '顎', '掛', '潟', '括', '活', '喝', '渇', '割', '葛', '滑', '褐', '轄', '且', '株', '釜', '鎌', '刈', '干', '刊', '甘', '汗', '缶', '完', '肝', '官', '冠', '巻', '看', '陥', '乾', '勘', '患', '貫', '寒', '喚', '堪', '換', '敢', '棺', '款', '間', '閑', '勧', '寛', '幹', '感', '漢', '慣', '管', '関', '歓', '監', '緩', '憾', '還', '館', '環', '簡', '観', '韓', '艦', '鑑', '丸', '含', '岸', '岩', '玩', '眼', '頑', '顔', '願', '企', '伎', '危', '机', '気', '岐', '希', '忌', '汽', '奇', '祈', '季', '紀', '軌', '既', '記', '起', '飢', '鬼', '帰', '基', '寄', '規', '亀', '喜', '幾', '揮', '期', '棋', '貴', '棄', '毀', '旗', '器', '畿', '輝', '機', '騎', '技', '宜', '偽', '欺', '義', '疑', '儀', '戯', '擬', '犠', '議', '菊', '吉', '喫', '詰', '却', '客', '脚', '逆', '虐', '九', '久', '及', '弓', '丘', '旧', '休', '吸', '朽', '臼', '求', '究', '泣', '急', '級', '糾', '宮', '救', '球', '給', '嗅', '窮', '牛', '去', '巨', '居', '拒', '拠', '挙', '虚', '許', '距', '魚', '御', '漁', '凶', '共', '叫', '狂', '京', '享', '供', '協', '況', '峡', '挟', '狭', '恐', '恭', '胸', '脅', '強', '教', '郷', '境', '橋', '矯', '鏡', '競', '響', '驚', '仰', '暁', '業', '凝', '曲', '局', '極', '玉', '巾', '斤', '均', '近', '金', '菌', '勤', '琴', '筋', '僅', '禁', '緊', '錦', '謹', '襟', '吟', '銀', '区', '句', '苦', '駆', '具', '惧', '愚', '空', '偶', '遇', '隅', '串', '屈', '掘', '窟', '熊', '繰', '君', '訓', '勲', '薫', '軍', '郡', '群', '兄', '刑', '形', '系', '径', '茎', '係', '型', '契', '計', '恵', '啓', '掲', '渓', '経', '蛍', '敬', '景', '軽', '傾', '携', '継', '詣', '慶', '憬', '稽', '憩', '警', '鶏', '芸', '迎', '鯨', '隙', '劇', '撃', '激', '桁', '欠', '穴', '血', '決', '結', '傑', '潔', '月', '犬', '件', '見', '券', '肩', '建', '研', '県', '倹', '兼', '剣', '拳', '軒', '健', '険', '圏', '堅', '検', '嫌', '献', '絹', '遣', '権', '憲', '賢', '謙', '鍵', '繭', '顕', '験', '懸', '元', '幻', '玄', '言', '弦', '限', '原', '現', '舷', '減', '源', '厳', '己', '戸', '古', '呼', '固', '股', '虎', '孤', '弧', '故', '枯', '個', '庫', '湖', '雇', '誇', '鼓', '錮', '顧', '五', '互', '午', '呉', '後', '娯', '悟', '碁', '語', '誤', '護', '口', '工', '公', '勾', '孔', '功', '巧', '広', '甲', '交', '光', '向', '后', '好', '江', '考', '行', '坑', '孝', '抗', '攻', '更', '効', '幸', '拘', '肯', '侯', '厚', '恒', '洪', '皇', '紅', '荒', '郊', '香', '候', '校', '耕', '航', '貢', '降', '高', '康', '控', '梗', '黄', '喉', '慌', '港', '硬', '絞', '項', '溝', '鉱', '構', '綱', '酵', '稿', '興', '衡', '鋼', '講', '購', '乞', '号', '合', '拷', '剛', '傲', '豪', '克', '告', '谷', '刻', '国', '黒', '穀', '酷', '獄', '骨', '駒', '込', '頃', '今', '困', '昆', '恨', '根', '婚', '混', '痕', '紺', '魂', '墾', '懇', '左', '佐', '沙', '査', '砂', '唆', '差', '詐', '鎖', '座', '挫', '才', '再', '災', '妻', '采', '砕', '宰', '栽', '彩', '採', '済', '祭', '斎', '細', '菜', '最', '裁', '債', '催', '塞', '歳', '載', '際', '埼', '在', '材', '剤', '財', '罪', '崎', '作', '削', '昨', '柵', '索', '策', '酢', '搾', '錯', '咲', '冊', '札', '刷', '刹', '拶', '殺', '察', '撮', '擦', '雑', '皿', '三', '山', '参', '桟', '蚕', '惨', '産', '傘', '散', '算', '酸', '賛', '残', '斬', '暫', '士', '子', '支', '止', '氏', '仕', '史', '司', '四', '市', '矢', '旨', '死', '糸', '至', '伺', '志', '私', '使', '刺', '始', '姉', '枝', '祉', '肢', '姿', '思', '指', '施', '師', '恣', '紙', '脂', '視', '紫', '詞', '歯', '嗣', '試', '詩', '資', '飼', '誌', '雌', '摯', '賜', '諮', '示', '字', '寺', '次', '耳', '自', '似', '児', '事', '侍', '治', '持', '時', '滋', '慈', '辞', '磁', '餌', '璽', '鹿', '式', '識', '軸', '七', '𠮟', '失', '室', '疾', '執', '湿', '嫉', '漆', '質', '実', '芝', '写', '社', '車', '舎', '者', '射', '捨', '赦', '斜', '煮', '遮', '謝', '邪', '蛇', '尺', '借', '酌', '釈', '爵', '若', '弱', '寂', '手', '主', '守', '朱', '取', '狩', '首', '殊', '珠', '酒', '腫', '種', '趣', '寿', '受', '呪', '授', '需', '儒', '樹', '収', '囚', '州', '舟', '秀', '周', '宗', '拾', '秋', '臭', '修', '袖', '終', '羞', '習', '週', '就', '衆', '集', '愁', '酬', '醜', '蹴', '襲', '十', '汁', '充', '住', '柔', '重', '従', '渋', '銃', '獣', '縦', '叔', '祝', '宿', '淑', '粛', '縮', '塾', '熟', '出', '述', '術', '俊', '春', '瞬', '旬', '巡', '盾', '准', '殉', '純', '循', '順', '準', '潤', '遵', '処', '初', '所', '書', '庶', '暑', '署', '緒', '諸', '女', '如', '助', '序', '叙', '徐', '除', '小', '升', '少', '召', '匠', '床', '抄', '肖', '尚', '招', '承', '昇', '松', '沼', '昭', '宵', '将', '消', '症', '祥', '称', '笑', '唱', '商', '渉', '章', '紹', '訟', '勝', '掌', '晶', '焼', '焦', '硝', '粧', '詔', '証', '象', '傷', '奨', '照', '詳', '彰', '障', '憧', '衝', '賞', '償', '礁', '鐘', '上', '丈', '冗', '条', '状', '乗', '城', '浄', '剰', '常', '情', '場', '畳', '蒸', '縄', '壌', '嬢', '錠', '譲', '醸', '色', '拭', '食', '植', '殖', '飾', '触', '嘱', '織', '職', '辱', '尻', '心', '申', '伸', '臣', '芯', '身', '辛', '侵', '信', '津', '神', '唇', '娠', '振', '浸', '真', '針', '深', '紳', '進', '森', '診', '寝', '慎', '新', '審', '震', '薪', '親', '人', '刃', '仁', '尽', '迅', '甚', '陣', '尋', '腎', '須', '図', '水', '吹', '垂', '炊', '帥', '粋', '衰', '推', '酔', '遂', '睡', '穂', '随', '髄', '枢', '崇', '数', '据', '杉', '裾', '寸', '瀬', '是', '井', '世', '正', '生', '成', '西', '声', '制', '姓', '征', '性', '青', '斉', '政', '星', '牲', '省', '凄', '逝', '清', '盛', '婿', '晴', '勢', '聖', '誠', '精', '製', '誓', '静', '請', '整', '醒', '税', '夕', '斥', '石', '赤', '昔', '析', '席', '脊', '隻', '惜', '戚', '責', '跡', '積', '績', '籍', '切', '折', '拙', '窃', '接', '設', '雪', '摂', '節', '説', '舌', '絶', '千', '川', '仙', '占', '先', '宣', '専', '泉', '浅', '洗', '染', '扇', '栓', '旋', '船', '戦', '煎', '羨', '腺', '詮', '践', '箋', '銭', '潜', '線', '遷', '選', '薦', '繊', '鮮', '全', '前', '善', '然', '禅', '漸', '膳', '繕', '狙', '阻', '祖', '租', '素', '措', '粗', '組', '疎', '訴', '塑', '遡', '礎', '双', '壮', '早', '争', '走', '奏', '相', '荘', '草', '送', '倉', '捜', '挿', '桑', '巣', '掃', '曹', '曽', '爽', '窓', '創', '喪', '痩', '葬', '装', '僧', '想', '層', '総', '遭', '槽', '踪', '操', '燥', '霜', '騒', '藻', '造', '像', '増', '憎', '蔵', '贈', '臓', '即', '束', '足', '促', '則', '息', '捉', '速', '側', '測', '俗', '族', '属', '賊', '続', '卒', '率', '存', '村', '孫', '尊', '損', '遜', '他', '多', '汰', '打', '妥', '唾', '堕', '惰', '駄', '太', '対', '体', '耐', '待', '怠', '胎', '退', '帯', '泰', '堆', '袋', '逮', '替', '貸', '隊', '滞', '態', '戴', '大', '代', '台', '第', '題', '滝', '宅', '択', '沢', '卓', '拓', '託', '濯', '諾', '濁', '但', '達', '脱', '奪', '棚', '誰', '丹', '旦', '担', '単', '炭', '胆', '探', '淡', '短', '嘆', '端', '綻', '誕', '鍛', '団', '男', '段', '断', '弾', '暖', '談', '壇', '地', '池', '知', '値', '恥', '致', '遅', '痴', '稚', '置', '緻', '竹', '畜', '逐', '蓄', '築', '秩', '窒', '茶', '着', '嫡', '中', '仲', '虫', '沖', '宙', '忠', '抽', '注', '昼', '柱', '衷', '酎', '鋳', '駐', '著', '貯', '丁', '弔', '庁', '兆', '町', '長', '挑', '帳', '張', '彫', '眺', '釣', '頂', '鳥', '朝', '貼', '超', '腸', '跳', '徴', '嘲', '潮', '澄', '調', '聴', '懲', '直', '勅', '捗', '沈', '珍', '朕', '陳', '賃', '鎮', '追', '椎', '墜', '通', '痛', '塚', '漬', '坪', '爪', '鶴', '低', '呈', '廷', '弟', '定', '底', '抵', '邸', '亭', '貞', '帝', '訂', '庭', '逓', '停', '偵', '堤', '提', '程', '艇', '締', '諦', '泥', '的', '笛', '摘', '滴', '適', '敵', '溺', '迭', '哲', '鉄', '徹', '撤', '天', '典', '店', '点', '展', '添', '転', '塡', '田', '伝', '殿', '電', '斗', '吐', '妬', '徒', '途', '都', '渡', '塗', '賭', '土', '奴', '努', '度', '怒', '刀', '冬', '灯', '当', '投', '豆', '東', '到', '逃', '倒', '凍', '唐', '島', '桃', '討', '透', '党', '悼', '盗', '陶', '塔', '搭', '棟', '湯', '痘', '登', '答', '等', '筒', '統', '稲', '踏', '糖', '頭', '謄', '藤', '闘', '騰', '同', '洞', '胴', '動', '堂', '童', '道', '働', '銅', '導', '瞳', '峠', '匿', '特', '得', '督', '徳', '篤', '毒', '独', '読', '栃', '凸', '突', '届', '屯', '豚', '頓', '貪', '鈍', '曇', '丼', '那', '奈', '内', '梨', '謎', '鍋', '南', '軟', '難', '二', '尼', '弐', '匂', '肉', '虹', '日', '入', '乳', '尿', '任', '妊', '忍', '認', '寧', '熱', '年', '念', '捻', '粘', '燃', '悩', '納', '能', '脳', '農', '濃', '把', '波', '派', '破', '覇', '馬', '婆', '罵', '拝', '杯', '背', '肺', '俳', '配', '排', '敗', '廃', '輩', '売', '倍', '梅', '培', '陪', '媒', '買', '賠', '白', '伯', '拍', '泊', '迫', '剝', '舶', '博', '薄', '麦', '漠', '縛', '爆', '箱', '箸', '畑', '肌', '八', '鉢', '発', '髪', '伐', '抜', '罰', '閥', '反', '半', '氾', '犯', '帆', '汎', '伴', '判', '坂', '阪', '板', '版', '班', '畔', '般', '販', '斑', '飯', '搬', '煩', '頒', '範', '繁', '藩', '晩', '番', '蛮', '盤', '比', '皮', '妃', '否', '批', '彼', '披', '肥', '非', '卑', '飛', '疲', '秘', '被', '悲', '扉', '費', '碑', '罷', '避', '尾', '眉', '美', '備', '微', '鼻', '膝', '肘', '匹', '必', '泌', '筆', '姫', '百', '氷', '表', '俵', '票', '評', '漂', '標', '苗', '秒', '病', '描', '猫', '品', '浜', '貧', '賓', '頻', '敏', '瓶', '不', '夫', '父', '付', '布', '扶', '府', '怖', '阜', '附', '訃', '負', '赴', '浮', '婦', '符', '富', '普', '腐', '敷', '膚', '賦', '譜', '侮', '武', '部', '舞', '封', '風', '伏', '服', '副', '幅', '復', '福', '腹', '複', '覆', '払', '沸', '仏', '物', '粉', '紛', '雰', '噴', '墳', '憤', '奮', '分', '文', '聞', '丙', '平', '兵', '併', '並', '柄', '陛', '閉', '塀', '幣', '弊', '蔽', '餅', '米', '壁', '璧', '癖', '別', '蔑', '片', '辺', '返', '変', '偏', '遍', '編', '弁', '便', '勉', '歩', '保', '哺', '捕', '補', '舗', '母', '募', '墓', '慕', '暮', '簿', '方', '包', '芳', '邦', '奉', '宝', '抱', '放', '法', '泡', '胞', '俸', '倣', '峰', '砲', '崩', '訪', '報', '蜂', '豊', '飽', '褒', '縫', '亡', '乏', '忙', '坊', '妨', '忘', '防', '房', '肪', '某', '冒', '剖', '紡', '望', '傍', '帽', '棒', '貿', '貌', '暴', '膨', '謀', '頰', '北', '木', '朴', '牧', '睦', '僕', '墨', '撲', '没', '勃', '堀', '本', '奔', '翻', '凡', '盆', '麻', '摩', '磨', '魔', '毎', '妹', '枚', '昧', '埋', '幕', '膜', '枕', '又', '末', '抹', '万', '満', '慢', '漫', '未', '味', '魅', '岬', '密', '蜜', '脈', '妙', '民', '眠', '矛', '務', '無', '夢', '霧', '娘', '名', '命', '明', '迷', '冥', '盟', '銘', '鳴', '滅', '免', '面', '綿', '麺', '茂', '模', '毛', '妄', '盲', '耗', '猛', '網', '目', '黙', '門', '紋', '問', '冶', '夜', '野', '弥', '厄', '役', '約', '訳', '薬', '躍', '闇', '由', '油', '喩', '愉', '諭', '輸', '癒', '唯', '友', '有', '勇', '幽', '悠', '郵', '湧', '猶', '裕', '遊', '雄', '誘', '憂', '融', '優', '与', '予', '余', '誉', '預', '幼', '用', '羊', '妖', '洋', '要', '容', '庸', '揚', '揺', '葉', '陽', '溶', '腰', '様', '瘍', '踊', '窯', '養', '擁', '謡', '曜', '抑', '沃', '浴', '欲', '翌', '翼', '拉', '裸', '羅', '来', '雷', '頼', '絡', '落', '酪', '辣', '乱', '卵', '覧', '濫', '藍', '欄', '吏', '利', '里', '理', '痢', '裏', '履', '璃', '離', '陸', '立', '律', '慄', '略', '柳', '流', '留', '竜', '粒', '隆', '硫', '侶', '旅', '虜', '慮', '了', '両', '良', '料', '涼', '猟', '陵', '量', '僚', '領', '寮', '療', '瞭', '糧', '力', '緑', '林', '厘', '倫', '輪', '隣', '臨', '瑠', '涙', '累', '塁', '類', '令', '礼', '冷', '励', '戻', '例', '鈴', '零', '霊', '隷', '齢', '麗', '暦', '歴', '列', '劣', '烈', '裂', '恋', '連', '廉', '練', '錬', '呂', '炉', '賂', '路', '露', '老', '労', '弄', '郎', '朗', '浪', '廊', '楼', '漏', '籠', '六', '録', '麓', '論', '和', '話', '賄', '脇', '惑', '枠', '湾', '腕']
// const russianList = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
const turkishList = ['a', 'b', 'c', 'ç', 'd', 'e', 'f', 'g', 'ğ', 'h', 'ı', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'ö', 'p', 'r', 's', 'ş', 't', 'u', 'ü', 'v', 'y', 'z', 'q', 'w', 'x']
const vietnameseList = ['a', 'á', 'à', 'ă', 'ắ', 'ằ', 'ẵ', 'ẳ', 'â', 'ấ', 'ầ', 'ẫ', 'ẩ', 'ã', 'ả', 'ạ', 'ặ', 'ậ', 'b', 'c', 'd', 'đ', 'e', 'é', 'è', 'ê', 'ế', 'ề', 'ễ', 'ể', 'ẽ', 'ẻ', 'ẹ', 'ệ', 'f', 'g', 'h', 'i', 'í', 'ì', 'ĩ', 'ỉ', 'ị', 'j', 'k', 'l', 'm', 'n', 'o', 'ó', 'ò', 'ô', 'ố', 'ồ', 'ỗ', 'ổ', 'õ', 'ỏ', 'ơ', 'ớ', 'ờ', 'ỡ', 'ở', 'ợ', 'ọ', 'ộ', 'p', 'q', 'r', 's', 't', 'u', 'ú', 'ù', 'ũ', 'ủ', 'ư', 'ứ', 'ừ', 'ữ', 'ử', 'ự', 'ụ', 'v', 'w', 'x', 'y', 'ý', 'ỳ', 'ỹ', 'ỷ', 'ỵ', 'z']
const thaiList = ['๐', '๑', '๒', '๓', '๔', '๕', '๖', '๗', '๘', '๙', 'ก', 'ก็', 'ก่', 'ก้', 'ก๊', 'ก๋', 'ก์', 'กํ', 'กั', 'กั่', 'กั้', 'กั๊', 'กั๋', 'กิ', 'กิ่', 'กิ้', 'กิ๊', 'กิ๋', 'กี', 'กี่', 'กี้', 'กี๊', 'กี๋', 'กึ', 'กึ่', 'กึ้', 'กึ๊', 'กึ๋', 'กื', 'กื่', 'กื้', 'กุ', 'กุ่', 'กุ้', 'กุ๊', 'กุ๋', 'กู', 'กู่', 'กู้', 'กู๊', 'กู๋', 'ข', 'ข็', 'ข่', 'ข้', 'ข์', 'ขั', 'ขั่', 'ขั้', 'ขิ', 'ขิ่', 'ขี', 'ขี่', 'ขี้', 'ขึ', 'ขึ่', 'ขึ้', 'ขื', 'ขื่', 'ขื้', 'ขุ', 'ขุ่', 'ขุ้', 'ขู', 'ขู่', 'ฃ', 'ฃ่', 'ฃ้', 'ฃ์', 'ฃั', 'ฃี', 'ฃื', 'ฃุ', 'ค', 'ค็', 'ค่', 'ค้', 'ค์', 'คํ', 'คั', 'คั่', 'คั้', 'คิ', 'คิ่', 'คิ้', 'คี', 'คี่', 'คี้', 'คึ', 'คึ่', 'คึ้', 'คื', 'คื่', 'คื้', 'คุ', 'คุ่', 'คุ้', 'คุ์', 'คู', 'คู่', 'คู้', 'คู๊', 'คฺ', 'ฅ', 'ฆ', 'ฆ่', 'ฆ้', 'ฆ์', 'ฆั', 'ฆิ', 'ฆี', 'ฆี่', 'ฆุ', 'ฆู', 'ง', 'ง็', 'ง่', 'ง้', 'งั', 'งั่', 'งั้', 'งิ', 'งิ้', 'งี', 'งี่', 'งี้', 'งี๊', 'งึ', 'งึ่', 'งึ้', 'งื', 'งื่', 'งื้', 'งุ', 'งุ่', 'งุ้', 'งู', 'งู่', 'งู้', 'จ', 'จ็', 'จ่', 'จ้', 'จ๊', 'จ๋', 'จ์', 'จํ', 'จั', 'จั่', 'จั้', 'จั๊', 'จั๋', 'จิ', 'จิ่', 'จิ้', 'จิ๊', 'จิ๋', 'จี', 'จี่', 'จี้', 'จี๊', 'จี๋', 'จึ', 'จึ่', 'จึ้', 'จึ๊', 'จึ๋', 'จื', 'จื่', 'จื้', 'จื๊', 'จื๋', 'จุ', 'จุ่', 'จุ้', 'จุ๊', 'จุ๋', 'จู', 'จู่', 'จู้', 'จู๊', 'จู๋', 'ฉ', 'ฉ่', 'ฉ้', 'ฉั', 'ฉิ', 'ฉิ่', 'ฉิ้', 'ฉี', 'ฉี่', 'ฉี้', 'ฉึ', 'ฉึ่', 'ฉื', 'ฉื่', 'ฉุ', 'ฉุ่', 'ฉู', 'ฉู่', 'ช', 'ช็', 'ช่', 'ช้', 'ช์', 'ชํ', 'ชั', 'ชั่', 'ชั้', 'ชิ', 'ชิ่', 'ชิ้', 'ชี', 'ชี่', 'ชี้', 'ชึ', 'ชึ่', 'ชึ้', 'ชื', 'ชื่', 'ชื้', 'ชุ', 'ชุ่', 'ชุ้', 'ชุ์', 'ชู', 'ชู่', 'ชู้', 'ซ', 'ซ็', 'ซ่', 'ซ้', 'ซ์', 'ซั', 'ซั่', 'ซั้', 'ซิ', 'ซิ่', 'ซิ้', 'ซี', 'ซี่', 'ซี้', 'ซี๊', 'ซึ', 'ซึ่', 'ซึ้', 'ซื', 'ซื่', 'ซื้', 'ซุ', 'ซุ่', 'ซุ้', 'ซู', 'ซู่', 'ซู้', 'ฌ', 'ฌ็', 'ฌ้', 'ฌั', 'ฌิ', 'ฌุ', 'ฌู', 'ญ', 'ญ่', 'ญ้', 'ญ์', 'ญั', 'ญิ', 'ญิ่', 'ญิ๋', 'ญี', 'ญี่', 'ญึ', 'ญื', 'ญุ', 'ญุ่', 'ญู', 'ญฺ', 'ฎ', 'ฎ์', 'ฎิ', 'ฎิ์', 'ฎี', 'ฎึ', 'ฎุ', 'ฏ', 'ฏ์', 'ฏั', 'ฏิ', 'ฏิ์', 'ฏี', 'ฐ', 'ฐ์', 'ฐั', 'ฐิ', 'ฐี', 'ฐุ', 'ฑ', 'ฑ์', 'ฑั', 'ฑิ', 'ฑี', 'ฑุ', 'ฑู', 'ฒ', 'ฒ่', 'ฒ์', 'ฒิ', 'ฒุ่', 'ณ', 'ณ์', 'ณั', 'ณิ', 'ณี', 'ณื', 'ณุ', 'ณู', 'ณฺ', 'ด', 'ด็', 'ด่', 'ด้', 'ด๊', 'ด๋', 'ด์', 'ดํ', 'ดั', 'ดั่', 'ดั้', 'ดั๊', 'ดั๋', 'ดิ', 'ดิ่', 'ดิ้', 'ดิ๊', 'ดิ๋', 'ดิ์', 'ดี', 'ดี่', 'ดี้', 'ดี๊', 'ดี๋', 'ดึ', 'ดึ้', 'ดึ๊', 'ดึ๋', 'ดื', 'ดื่', 'ดื้', 'ดื๊', 'ดื๋', 'ดุ', 'ดุ่', 'ดุ้', 'ดุ๊', 'ดุ์', 'ดู', 'ดู่', 'ดู้', 'ดู๊', 'ดู๋', 'ต', 'ต็', 'ต่', 'ต่้', 'ต้', 'ต๊', 'ต๋', 'ต์', 'ตํ', 'ตั', 'ตั่', 'ตั้', 'ตั๊', 'ตั๋', 'ติ', 'ติ่', 'ติ้', 'ติ๊', 'ติ๋', 'ติ์', 'ตี', 'ตี่', 'ตี้', 'ตี๊', 'ตี๋', 'ตึ', 'ตึ่', 'ตึ้', 'ตึ๊', 'ตึ๋', 'ตื', 'ตื่', 'ตื้', 'ตื๊', 'ตื๋', 'ตุ', 'ตุ่', 'ตุ้', 'ตุ๊', 'ตุ๋', 'ตู', 'ตู่', 'ตู้', 'ตู๊', 'ตู๋', 'ตฺ', 'ถ', 'ถ่', 'ถ้', 'ถ์', 'ถั', 'ถั่', 'ถิ', 'ถิ่', 'ถิ้', 'ถิ์', 'ถี', 'ถี่', 'ถึ', 'ถึ่', 'ถื', 'ถื่', 'ถุ', 'ถุ่', 'ถุ้', 'ถุ์', 'ถู', 'ถู่', 'ท', 'ท็', 'ท่', 'ท้', 'ท๊', 'ท์', 'ทํ', 'ทั', 'ทั่', 'ทั้', 'ทิ', 'ทิ่', 'ทิ้', 'ทิ์', 'ที', 'ที่', 'ที่่', 'ที้', 'ทึ', 'ทึ่', 'ทึ้', 'ทื', 'ทื่', 'ทุ', 'ทุ่', 'ทุ้', 'ทุ์', 'ทู', 'ทู่', 'ทู้', 'ธ', 'ธ่', 'ธ์', 'ธั', 'ธิ', 'ธิ่', 'ธิ์', 'ธี', 'ธี่', 'ธึ', 'ธึ่', 'ธื์', 'ธุ', 'ธุ๊', 'ธุ๋', 'ธุ์', 'ธู', 'น', 'น็', 'น่', 'น้', 'น้ํ', 'น๊', 'น๋', 'น์', 'นํ', 'นั', 'นั่', 'นั้', 'นิ', 'นิ่', 'นิ้', 'นิ์', 'นี', 'นี่', 'นี้', 'นึ', 'นึ่', 'นึ้', 'นื', 'นื่', 'นื้', 'นุ', 'นุ่', 'นุ้', 'นู', 'นู่', 'นู้', 'นู๋', 'นฺ', 'บ', 'บ็', 'บ่', 'บ้', 'บ๊', 'บ๋', 'บ์', 'บํ', 'บั', 'บั่', 'บั้', 'บั๊', 'บั๋', 'บิ', 'บิ่', 'บิ้', 'บิ๊', 'บี', 'บี่', 'บี้', 'บี๊', 'บี๋', 'บึ', 'บึ่', 'บึ้', 'บื', 'บื่', 'บื้', 'บื๊', 'บุ', 'บุ่', 'บุ้', 'บุ๊', 'บุ๋', 'บู', 'บู่', 'บู้', 'บู๊', 'บู๋', 'ป', 'ป็', 'ป่', 'ป้', 'ป๊', 'ป๋', 'ป์', 'ปั', 'ปั่', 'ปั้', 'ปั๊', 'ปั๋', 'ปิ', 'ปิ่', 'ปิ้', 'ปิ๊', 'ปิ๋', 'ปี', 'ปี่', 'ปี้', 'ปี๊', 'ปี๋', 'ปึ', 'ปึ่', 'ปึ้', 'ปึ๊', 'ปึ๋', 'ปื', 'ปื่', 'ปื้', 'ปื๊', 'ปุ', 'ปุ่', 'ปุ้', 'ปุ๊', 'ปุ๋', 'ปู', 'ปู่', 'ปู้', 'ปู๊', 'ปู๋', 'ผ', 'ผ็', 'ผ่', 'ผ้', 'ผั', 'ผั่', 'ผิ', 'ผิ่', 'ผี', 'ผึ', 'ผึ่', 'ผึ้', 'ผื', 'ผื่', 'ผุ', 'ผุ่', 'ผุ้', 'ผู', 'ผู่', 'ผู้', 'ฝ', 'ฝ่', 'ฝ้', 'ฝั', 'ฝั่', 'ฝั้', 'ฝิ', 'ฝิ่', 'ฝิ้', 'ฝี', 'ฝึ', 'ฝึ้', 'ฝื', 'ฝื่', 'ฝุ่', 'ฝู', 'ฝู่', 'พ', 'พ็', 'พ่', 'พ้', 'พ์', 'พํ', 'พั', 'พั่', 'พั้', 'พิ', 'พิ่', 'พิ้', 'พี', 'พี่', 'พี้', 'พึ', 'พึ่', 'พื', 'พื่', 'พื้', 'พุ', 'พุ่', 'พุ้', 'พู', 'พู่', 'พู้', 'พฺ', 'ฟ', 'ฟ็', 'ฟ่', 'ฟ้', 'ฟ์', 'ฟั', 'ฟั่', 'ฟั้', 'ฟิ', 'ฟิ่', 'ฟิ้', 'ฟี', 'ฟี่', 'ฟี้', 'ฟึ', 'ฟึ่', 'ฟื', 'ฟื่', 'ฟื้', 'ฟุ', 'ฟุ่', 'ฟุ้', 'ฟู', 'ฟู่', 'ฟู้', 'ฟู๊', 'ภ', 'ภ้', 'ภ์', 'ภั', 'ภิ', 'ภี', 'ภุ', 'ภู', 'ภู่', 'ม', 'ม็', 'ม่', 'ม้', 'ม๊', 'ม์', 'มั', 'มั่', 'มั้', 'มั๊', 'มิ', 'มิ่', 'มิ้', 'มิ์', 'มี', 'มี่', 'มี้', 'มี๊', 'มึ', 'มึ้', 'มื', 'มื่', 'มื้', 'มุ', 'มุ่', 'มุ้', 'มู', 'มู่', 'มู้', 'มฺ', 'ย', 'ย็', 'ย่', 'ย้', 'ย๊', 'ย์', 'ยํ', 'ยั', 'ยั่', 'ยั้', 'ยิ', 'ยิ่', 'ยิ้', 'ยี', 'ยี่', 'ยี้', 'ยึ', 'ยื', 'ยื่', 'ยื้', 'ยุ', 'ยุ่', 'ยุ้', 'ยู', 'ยู่', 'ยู้', 'ยู๋', 'ร', 'ร็', 'ร่', 'ร้', 'ร๊', 'ร๋', 'ร์', 'รํ', 'รั', 'รั่', 'รั้', 'รั๊', 'ริ', 'ริ่', 'ริ้', 'ริ๊', 'ริ๋', 'ริ์', 'รี', 'รี่', 'รี้', 'รี๊', 'รึ', 'รึ่', 'รึ่่', 'รึ้', 'รื', 'รื่', 'รื้', 'รื๋', 'รุ', 'รุ่', 'รุ้', 'รุ๊', 'รู', 'รู่', 'รู้', 'รู๊', 'ฤ', 'ฤิ', 'ล', 'ล็', 'ล่', 'ล้', 'ล๊', 'ล์', 'ลํ', 'ลั', 'ลั่', 'ลั้', 'ลั๊', 'ลิ', 'ลิ่', 'ลิ้', 'ลิ์', 'ลี', 'ลี่', 'ลี้', 'ลี๊', 'ลึ', 'ลึ่', 'ลื', 'ลื่', 'ลื้', 'ลุ', 'ลุ่', 'ลุ้', 'ลู', 'ลู่', 'ลู้', 'ฦ', 'ว', 'ว็', 'ว่', 'ว่่', 'ว้', 'ว๊', 'ว๋', 'ว์', 'วํ', 'วํ่', 'วั', 'วั่', 'วั้', 'วิ', 'วิ่', 'วิ้', 'วิ๋', 'วี', 'วี่', 'วี้', 'วี๊', 'วึ', 'วึ่', 'วื', 'วื้', 'วุ', 'วุ่', 'วุ้', 'วู', 'วู่', 'วู้', 'ศ', 'ศ้', 'ศ์', 'ศั', 'ศิ', 'ศี', 'ศึ', 'ศื', 'ศุ', 'ศู', 'ษ', 'ษ่', 'ษ์', 'ษั', 'ษิ', 'ษี', 'ษึ', 'ษุ', 'ส', 'ส็', 'ส่', 'ส่่', 'ส้', 'ส์', 'สํ', 'สั', 'สั่', 'สั้', 'สิ', 'สิ่', 'สิ้', 'สี', 'สี่', 'สี้', 'สึ', 'สื', 'สื่', 'สื้', 'สุ', 'สุ่', 'สุ้', 'สู', 'สู่', 'สู้', 'ห', 'ห็', 'ห่', 'ห้', 'ห๋', 'ห์', 'หั', 'หั่', 'หั้', 'หิ', 'หิ่', 'หิ้', 'หี', 'หี่', 'หี้', 'หึ', 'หึ่', 'หึ้', 'หื', 'หื่', 'หื้', 'หุ', 'หุ่', 'หุ้', 'หู', 'หู่', 'หู้', 'หฺ', 'ฬ', 'ฬ่', 'ฬิ', 'ฬี', 'ฬุ', 'อ', 'อ็', 'อ่', 'อ้', 'อ๊', 'อ๋', 'อ์', 'อํ', 'อั', 'อั่', 'อั้', 'อั๊', 'อั๋', 'อิ', 'อิ่', 'อิ้', 'อิ๊', 'อิ๋', 'อี', 'อี่', 'อี้', 'อี๊', 'อี๋', 'อึ', 'อึ่', 'อึ้', 'อึ๊', 'อึ๋', 'อื', 'อื่', 'อื้', 'อื๊', 'อื๋', 'อุ', 'อุ่', 'อุ้', 'อุ๊', 'อุ๋', 'อู', 'อู่', 'อู้', 'อู๊', 'อู๋', 'ฮ', 'ฮ็', 'ฮ่', 'ฮ้', 'ฮ์', 'ฮั', 'ฮั่', 'ฮั้', 'ฮิ', 'ฮิ้', 'ฮี', 'ฮี่', 'ฮี้', 'ฮึ', 'ฮึ่', 'ฮึ้', 'ฮื', 'ฮื่', 'ฮื้', 'ฮุ', 'ฮุ่', 'ฮุ้', 'ฮู', 'ฮู่', 'ฮู้', 'ะ', 'า', 'เ', 'แ', 'โ', 'ใ', 'ไ', 'ๅ']
const koreanList = ['가', '각', '간', '갇', '갈', '감', '갑', '값', '강', '갖', '같', '갚', '갛', '개', '객', '걀', '걔', '거', '걱', '건', '걷', '걸', '검', '겁', '것', '겉', '게', '겨', '격', '겪', '견', '결', '겹', '경', '곁', '계', '고', '곡', '곤', '곧', '골', '곰', '곱', '곳', '공', '과', '관', '광', '괜', '괴', '굉', '교', '구', '국', '군', '굳', '굴', '굵', '굶', '굽', '궁', '권', '귀', '규', '균', '그', '극', '근', '글', '긁', '금', '급', '긋', '긍', '기', '긴', '길', '김', '깅', '깊', '까', '깎', '깐', '깔', '깜', '깝', '깥', '깨', '꺼', '꺾', '껌', '껍', '껏', '께', '껴', '꼬', '꼭', '꼴', '꼼', '꼽', '꽂', '꽃', '꽉', '꽝', '꽤', '꾸', '꿀', '꿈', '뀌', '끄', '끈', '끊', '끌', '끓', '끔', '끗', '끝', '끼', '낌', '나', '낙', '낚', '난', '날', '낡', '남', '납', '낫', '낭', '낮', '낯', '낱', '낳', '내', '냄', '냉', '냐', '냥', '너', '넉', '널', '넓', '넘', '넣', '네', '넥', '넷', '녀', '녁', '년', '념', '녕', '노', '녹', '논', '놀', '놈', '농', '높', '놓', '놔', '뇌', '뇨', '누', '눈', '눕', '뉘', '뉴', '늄', '느', '늑', '늘', '늙', '능', '늦', '늬', '니', '닐', '님', '다', '닥', '닦', '단', '닫', '달', '닭', '닮', '담', '답', '닷', '당', '닿', '대', '댁', '댐', '더', '덕', '던', '덜', '덤', '덥', '덧', '덩', '덮', '데', '델', '도', '독', '돈', '돌', '돕', '돗', '동', '되', '두', '둑', '둘', '둠', '둡', '둥', '뒤', '뒷', '드', '득', '든', '듣', '들', '듬', '듭', '듯', '등', '디', '딩', '딪', '따', '딱', '딸', '땅', '때', '떠', '떡', '떤', '떨', '떳', '떻', '떼', '또', '똑', '뚜', '뚱', '뛰', '뜨', '뜩', '뜻', '라', '락', '란', '람', '랍', '랑', '랗', '래', '랜', '램', '랫', '략', '량', '러', '럭', '런', '럴', '럼', '럽', '럿', '렁', '렇', '레', '렉', '렌', '렛', '려', '력', '련', '렬', '렵', '렷', '령', '례', '로', '록', '론', '롬', '롭', '롯', '료', '루', '룩', '룹', '룻', '뤄', '류', '륙', '률', '륭', '르', '른', '름', '릇', '릉', '릎', '리', '릭', '린', '림', '립', '릿', '마', '막', '만', '많', '말', '맑', '맘', '맙', '맛', '망', '맞', '맡', '맣', '매', '맥', '맨', '맵', '맺', '머', '먹', '먼', '멀', '멈', '멋', '멍', '멎', '멓', '메', '멘', '며', '면', '멸', '명', '몇', '모', '목', '몰', '몸', '몹', '못', '몽', '묘', '무', '묵', '묶', '문', '묻', '물', '묽', '뭄', '뭇', '뭐', '뭣', '므', '미', '민', '믿', '밀', '밉', '밌', '및', '밑', '바', '박', '밖', '반', '받', '발', '밝', '밟', '밤', '밥', '방', '밭', '배', '백', '뱀', '뱃', '뱉', '버', '벅', '번', '벌', '범', '법', '벗', '베', '벤', '벨', '벼', '벽', '변', '별', '볍', '병', '볕', '보', '복', '볶', '본', '볼', '봄', '봉', '뵈', '뵙', '부', '북', '분', '불', '붉', '붐', '붓', '붕', '붙', '뷰', '브', '블', '비', '빈', '빌', '빗', '빚', '빛', '빠', '빨', '빵', '빼', '뺏', '뺨', '뻐', '뻔', '뻗', '뼈', '뽑', '뾰', '뿌', '뿐', '쁘', '쁨', '사', '삭', '산', '살', '삶', '삼', '상', '새', '색', '샌', '생', '서', '석', '섞', '선', '설', '섬', '섭', '섯', '성', '세', '섹', '센', '셈', '셋', '션', '소', '속', '손', '솔', '솜', '솟', '송', '솥', '쇄', '쇠', '쇼', '수', '숙', '순', '숟', '술', '숨', '숫', '숭', '숱', '숲', '쉬', '쉽', '슈', '스', '슨', '슬', '슴', '습', '슷', '승', '시', '식', '신', '싣', '실', '싫', '심', '십', '싱', '싶', '싸', '싹', '싼', '쌀', '쌍', '쌓', '써', '썩', '썰', '썹', '쎄', '쏘', '쏟', '쑤', '쑥', '쓰', '쓴', '쓸', '씀', '씌', '씨', '씩', '씬', '씹', '씻', '아', '악', '안', '앉', '않', '알', '앓', '암', '압', '앗', '앙', '앞', '애', '액', '앨', '야', '약', '얄', '얇', '얌', '양', '얕', '얗', '얘', '어', '억', '언', '얹', '얻', '얼', '엄', '업', '없', '엇', '엉', '엌', '엎', '에', '엔', '엘', '여', '역', '연', '열', '엷', '염', '엽', '엿', '영', '옆', '예', '옛', '오', '옥', '온', '올', '옮', '옳', '옷', '와', '완', '왕', '왜', '왠', '외', '왼', '요', '욕', '용', '우', '욱', '운', '울', '움', '웃', '웅', '워', '원', '월', '웨', '웬', '위', '윗', '유', '육', '율', '으', '윽', '은', '을', '음', '응', '의', '이', '익', '인', '일', '읽', '잃', '임', '입', '잇', '있', '잊', '잎', '자', '작', '잔', '잖', '잘', '잠', '잡', '장', '잦', '재', '쟁', '쟤', '저', '적', '전', '절', '젊', '점', '접', '젓', '정', '젖', '제', '젠', '젯', '져', '조', '족', '존', '졸', '좀', '좁', '종', '좋', '좌', '죄', '주', '죽', '준', '줄', '줌', '줍', '중', '쥐', '즈', '즉', '즌', '즐', '즘', '증', '지', '직', '진', '질', '짐', '집', '짓', '징', '짙', '짚', '짜', '짝', '짧', '째', '쨌', '쩌', '쩍', '쩐', '쩡', '쪽', '쫓', '쭈', '쭉', '찌', '찍', '찢', '차', '착', '찬', '찮', '찰', '참', '창', '찾', '채', '책', '챔', '챙', '처', '척', '천', '철', '첫', '청', '체', '쳐', '초', '촉', '촌', '총', '촬', '최', '추', '축', '춘', '출', '춤', '춥', '춧', '충', '취', '츠', '측', '츰', '층', '치', '칙', '친', '칠', '침', '칭', '카', '칸', '칼', '캄', '캐', '캘', '캠', '커', '컨', '컬', '컴', '컵', '컷', '켓', '켜', '코', '콜', '콤', '콩', '쾌', '쿠', '퀴', '크', '큰', '클', '큼', '키', '킬', '타', '탁', '탄', '탈', '탑', '탓', '탕', '태', '택', '탤', '터', '턱', '털', '텅', '테', '텍', '텔', '템', '토', '톤', '톨', '톱', '통', '퇴', '투', '툼', '퉁', '튀', '튜', '트', '특', '튼', '튿', '틀', '틈', '티', '틱', '팀', '팅', '파', '팎', '판', '팔', '패', '팩', '팬', '퍼', '퍽', '페', '펴', '편', '펼', '평', '폐', '포', '폭', '표', '푸', '푹', '풀', '품', '풍', '퓨', '프', '플', '픔', '피', '픽', '필', '핏', '핑', '하', '학', '한', '할', '함', '합', '항', '해', '핵', '핸', '햄', '햇', '행', '향', '허', '헌', '험', '헤', '헬', '혀', '현', '혈', '협', '형', '혜', '호', '혹', '혼', '홀', '홍', '화', '확', '환', '활', '황', '회', '획', '횟', '효', '후', '훈', '훌', '훔', '훨', '휘', '휴', '흉', '흐', '흑', '흔', '흘', '흙', '흡', '흥', '흩', '희', '흰', '히', '힘']
// const simplifiedChineseList = ['一', '乙', '二', '十', '丁', '厂', '七', '卜', '八', '人', '入', '儿', '匕', '几', '九', '刁', '了', '刀', '力', '乃', '又', '三', '干', '于', '亏', '工', '土', '士', '才', '下', '寸', '大', '丈', '与', '万', '上', '小', '口', '山', '巾', '千', '乞', '川', '亿', '个', '夕', '久', '么', '勺', '凡', '丸', '及', '广', '亡', '门', '丫', '义', '之', '尸', '己', '已', '巳', '弓', '子', '卫', '也', '女', '刃', '飞', '习', '叉', '马', '乡', '丰', '王', '开', '井', '天', '夫', '元', '无', '云', '专', '丐', '扎', '艺', '木', '五', '支', '厅', '不', '犬', '太', '区', '历', '歹', '友', '尤', '匹', '车', '巨', '牙', '屯', '戈', '比', '互', '切', '瓦', '止', '少', '曰', '日', '中', '贝', '冈', '内', '水', '见', '午', '牛', '手', '气', '毛', '壬', '升', '夭', '长', '仁', '什', '片', '仆', '化', '仇', '币', '仍', '仅', '斤', '爪', '反', '介', '父', '从', '仑', '今', '凶', '分', '乏', '公', '仓', '月', '氏', '勿', '欠', '风', '丹', '匀', '乌', '勾', '凤', '六', '文', '亢', '方', '火', '为', '斗', '忆', '计', '订', '户', '认', '冗', '讥', '心', '尺', '引', '丑', '巴', '孔', '队', '办', '以', '允', '予', '邓', '劝', '双', '书', '幻', '玉', '刊', '未', '末', '示', '击', '打', '巧', '正', '扑', '卉', '扒', '功', '扔', '去', '甘', '世', '艾', '古', '节', '本', '术', '可', '丙', '左', '厉', '石', '右', '布', '夯', '戊', '龙', '平', '灭', '轧', '东', '卡', '北', '占', '凸', '卢', '业', '旧', '帅', '归', '旦', '目', '且', '叶', '甲', '申', '叮', '电', '号', '田', '由', '只', '叭', '史', '央', '兄', '叽', '叼', '叫', '叩', '叨', '另', '叹', '冉', '皿', '凹', '囚', '四', '生', '矢', '失', '乍', '禾', '丘', '付', '仗', '代', '仙', '们', '仪', '白', '仔', '他', '斥', '瓜', '乎', '丛', '令', '用', '甩', '印', '尔', '乐', '句', '匆', '册', '卯', '犯', '外', '处', '冬', '鸟', '务', '包', '饥', '主', '市', '立', '冯', '玄', '闪', '兰', '半', '汁', '汇', '头', '汉', '宁', '穴', '它', '讨', '写', '让', '礼', '训', '议', '必', '讯', '记', '永', '司', '尼', '民', '弗', '弘', '岀', '辽', '奶', '奴', '召', '加', '皮', '边', '孕', '发', '圣', '对', '台', '矛', '纠', '母', '幼', '丝', '邦', '式', '迂', '刑', '戎', '动', '扛', '寺', '吉', '扣', '考', '托', '老', '巩', '圾', '执', '扩', '扫', '地', '场', '扬', '耳', '芋', '共', '芒', '亚', '芝', '朽', '朴', '机', '权', '过', '臣', '吏', '再', '协', '西', '压', '厌', '戌', '在', '百', '有', '存', '而', '页', '匠', '夸', '夺', '灰', '达', '列', '死', '成', '夹', '夷', '轨', '邪', '尧', '划', '迈', '毕', '至', '此', '贞', '师', '尘', '尖', '劣', '光', '当', '早', '吁', '吐', '吓', '虫', '曲', '团', '吕', '同', '吊', '吃', '因', '吸', '吗', '吆', '屿', '屹', '岁', '帆', '回', '岂', '则', '刚', '网', '肉', '年', '朱', '先', '丢', '廷', '舌', '竹', '迁', '乔', '迄', '伟', '传', '乒', '乓', '休', '伍', '伏', '优', '臼', '伐', '延', '仲', '件', '任', '伤', '价', '伦', '份', '华', '仰', '仿', '伙', '伪', '自', '伊', '血', '向', '似', '后', '行', '舟', '全', '会', '杀', '合', '兆', '企', '众', '爷', '伞', '创', '肌', '肋', '朵', '杂', '危', '旬', '旨', '旭', '负', '匈', '名', '各', '多', '争', '色', '壮', '冲', '妆', '冰', '庄', '庆', '亦', '刘', '齐', '交', '衣', '次', '产', '决', '亥', '充', '妄', '闭', '问', '闯', '羊', '并', '关', '米', '灯', '州', '汗', '污', '江', '汛', '池', '汝', '汤', '忙', '兴', '宇', '守', '宅', '字', '安', '讲', '讳', '军', '讶', '许', '讹', '论', '讼', '农', '讽', '设', '访', '诀', '寻', '那', '迅', '尽', '导', '异', '弛', '孙', '阵', '阳', '收', '阶', '阴', '防', '奸', '如', '妇', '妃', '好', '她', '妈', '戏', '羽', '观', '欢', '买', '红', '驮', '纤', '驯', '约', '级', '纪', '驰', '纫', '巡', '寿', '弄', '麦', '玖', '玛', '形', '进', '戒', '吞', '远', '违', '韧', '运', '扶', '抚', '坛', '技', '坏', '抠', '扰', '扼', '拒', '找', '批', '址', '扯', '走', '抄', '贡', '汞', '坝', '攻', '赤', '折', '抓', '扳', '抡', '扮', '抢', '孝', '坎', '均', '抑', '抛', '投', '坟', '坑', '抗', '坊', '抖', '护', '壳', '志', '块', '扭', '声', '把', '报', '拟', '却', '抒', '劫', '芙', '芜', '苇', '芽', '花', '芹', '芥', '芬', '苍', '芳', '严', '芦', '芯', '劳', '克', '芭', '苏', '杆', '杠', '杜', '材', '村', '杖', '杏', '杉', '巫', '极', '李', '杨', '求', '甫', '匣', '更', '束', '吾', '豆', '两', '酉', '丽', '医', '辰', '励', '否', '还', '尬', '歼', '来', '连', '轩', '步', '卤', '坚', '肖', '旱', '盯', '呈', '时', '吴', '助', '县', '里', '呆', '吱', '吠', '呕', '园', '旷', '围', '呀', '吨', '足', '邮', '男', '困', '吵', '串', '员', '呐', '听', '吟', '吩', '呛', '吻', '吹', '呜', '吭', '吧', '邑', '吼', '囤', '别', '吮', '岖', '岗', '帐', '财', '针', '钉', '牡', '告', '我', '乱', '利', '秃', '秀', '私', '每', '兵', '估', '体', '何', '佐', '佑', '但', '伸', '佃', '作', '伯', '伶', '佣', '低', '你', '住', '位', '伴', '身', '皂', '伺', '佛', '囱', '近', '彻', '役', '返', '余', '希', '坐', '谷', '妥', '含', '邻', '岔', '肝', '肛', '肚', '肘', '肠', '龟', '甸', '免', '狂', '犹', '狈', '角', '删', '条', '彤', '卵', '灸', '岛', '刨', '迎', '饭', '饮', '系', '言', '冻', '状', '亩', '况', '床', '库', '庇', '疗', '吝', '应', '这', '冷', '庐', '序', '辛', '弃', '冶', '忘', '闰', '闲', '间', '闷', '判', '兑', '灶', '灿', '灼', '弟', '汪', '沐', '沛', '汰', '沥', '沙', '汽', '沃', '沦', '汹', '泛', '沧', '没', '沟', '沪', '沈', '沉', '沁', '怀', '忧', '忱', '快', '完', '宋', '宏', '牢', '究', '穷', '灾', '良', '证', '启', '评', '补', '初', '社', '祀', '识', '诈', '诉', '罕', '诊', '词', '译', '君', '灵', '即', '层', '屁', '尿', '尾', '迟', '局', '改', '张', '忌', '际', '陆', '阿', '陈', '阻', '附', '坠', '妓', '妙', '妖', '姊', '妨', '妒', '努', '忍', '劲', '矣', '鸡', '纬', '驱', '纯', '纱', '纲', '纳', '驳', '纵', '纷', '纸', '纹', '纺', '驴', '纽', '奉', '玩', '环', '武', '青', '责', '现', '玫', '表', '规', '抹', '卦', '坷', '坯', '拓', '拢', '拔', '坪', '拣', '坦', '担', '坤', '押', '抽', '拐', '拖', '者', '拍', '顶', '拆', '拎', '拥', '抵', '拘', '势', '抱', '拄', '垃', '拉', '拦', '幸', '拌', '拧', '拂', '拙', '招', '坡', '披', '拨', '择', '抬', '拇', '拗', '其', '取', '茉', '苦', '昔', '苛', '若', '茂', '苹', '苗', '英', '苟', '苑', '苞', '范', '直', '茁', '茄', '茎', '苔', '茅', '枉', '林', '枝', '杯', '枢', '柜', '枚', '析', '板', '松', '枪', '枫', '构', '杭', '杰', '述', '枕', '丧', '或', '画', '卧', '事', '剌', '枣', '雨', '卖', '郁', '矶', '矿', '码', '厕', '奈', '奔', '奇', '奋', '态', '欧', '殴', '垄', '妻', '轰', '顷', '转', '斩', '轮', '软', '到', '非', '叔', '歧', '肯', '齿', '些', '卓', '虎', '虏', '肾', '贤', '尚', '旺', '具', '味', '果', '昆', '国', '哎', '咕', '昌', '呵', '畅', '明', '易', '咙', '昂', '迪', '典', '固', '忠', '呻', '咒', '咋', '咐', '呼', '鸣', '咏', '呢', '咄', '咖', '岸', '岩', '帖', '罗', '帜', '帕', '岭', '凯', '败', '账', '贩', '贬', '购', '贮', '图', '钓', '制', '知', '迭', '氛', '垂', '牧', '物', '乖', '刮', '秆', '和', '季', '委', '秉', '佳', '侍', '岳', '供', '使', '例', '侠', '侥', '版', '侄', '侦', '侣', '侧', '凭', '侨', '佩', '货', '侈', '依', '卑', '的', '迫', '质', '欣', '征', '往', '爬', '彼', '径', '所', '舍', '金', '刹', '命', '肴', '斧', '爸', '采', '觅', '受', '乳', '贪', '念', '贫', '忿', '肤', '肺', '肢', '肿', '胀', '朋', '股', '肮', '肪', '肥', '服', '胁', '周', '昏', '鱼', '兔', '狐', '忽', '狗', '狞', '备', '饰', '饱', '饲', '变', '京', '享', '庞', '店', '夜', '庙', '府', '底', '疟', '疙', '疚', '剂', '卒', '郊', '庚', '废', '净', '盲', '放', '刻', '育', '氓', '闸', '闹', '郑', '券', '卷', '单', '炬', '炒', '炊', '炕', '炎', '炉', '沫', '浅', '法', '泄', '沽', '河', '沾', '泪', '沮', '油', '泊', '沿', '泡', '注', '泣', '泞', '泻', '泌', '泳', '泥', '沸', '沼', '波', '泼', '泽', '治', '怔', '怯', '怖', '性', '怕', '怜', '怪', '怡', '学', '宝', '宗', '定', '宠', '宜', '审', '宙', '官', '空', '帘', '宛', '实', '试', '郎', '诗', '肩', '房', '诚', '衬', '衫', '视', '祈', '话', '诞', '诡', '询', '该', '详', '建', '肃', '录', '隶', '帚', '屉', '居', '届', '刷', '屈', '弧', '弥', '弦', '承', '孟', '陋', '陌', '孤', '陕', '降', '函', '限', '妹', '姑', '姐', '姓', '妮', '始', '姆', '迢', '驾', '叁', '参', '艰', '线', '练', '组', '绅', '细', '驶', '织', '驹', '终', '驻', '绊', '驼', '绍', '绎', '经', '贯', '契', '贰', '奏', '春', '帮', '玷', '珍', '玲', '珊', '玻', '毒', '型', '拭', '挂', '封', '持', '拷', '拱', '项', '垮', '挎', '城', '挟', '挠', '政', '赴', '赵', '挡', '拽', '哉', '挺', '括', '垢', '拴', '拾', '挑', '垛', '指', '垫', '挣', '挤', '拼', '挖', '按', '挥', '挪', '拯', '某', '甚', '荆', '茸', '革', '茬', '荐', '巷', '带', '草', '茧', '茵', '茶', '荒', '茫', '荡', '荣', '荤', '荧', '故', '胡', '荫', '荔', '南', '药', '标', '栈', '柑', '枯', '柄', '栋', '相', '查', '柏', '栅', '柳', '柱', '柿', '栏', '柠', '树', '勃', '要', '柬', '咸', '威', '歪', '研', '砖', '厘', '厚', '砌', '砂', '泵', '砚', '砍', '面', '耐', '耍', '牵', '鸥', '残', '殃', '轴', '轻', '鸦', '皆', '韭', '背', '战', '点', '虐', '临', '览', '竖', '省', '削', '尝', '昧', '盹', '是', '盼', '眨', '哇', '哄', '哑', '显', '冒', '映', '星', '昨', '咧', '昭', '畏', '趴', '胃', '贵', '界', '虹', '虾', '蚁', '思', '蚂', '虽', '品', '咽', '骂', '勋', '哗', '咱', '响', '哈', '哆', '咬', '咳', '咪', '哪', '哟', '炭', '峡', '罚', '贱', '贴', '贻', '骨', '幽', '钙', '钝', '钞', '钟', '钢', '钠', '钥', '钦', '钧', '钩', '钮', '卸', '缸', '拜', '看', '矩', '毡', '氢', '怎', '牲', '选', '适', '秒', '香', '种', '秋', '科', '重', '复', '竿', '段', '便', '俩', '贷', '顺', '修', '俏', '保', '促', '俄', '俐', '侮', '俭', '俗', '俘', '信', '皇', '泉', '鬼', '侵', '禹', '侯', '追', '俊', '盾', '待', '徊', '衍', '律', '很', '须', '叙', '剑', '逃', '食', '盆', '胚', '胧', '胆', '胜', '胞', '胖', '脉', '胎', '勉', '狭', '狮', '独', '狰', '狡', '狱', '狠', '贸', '怨', '急', '饵', '饶', '蚀', '饺', '饼', '峦', '弯', '将', '奖', '哀', '亭', '亮', '度', '迹', '庭', '疮', '疯', '疫', '疤', '咨', '姿', '亲', '音', '帝', '施', '闺', '闻', '闽', '阀', '阁', '差', '养', '美', '姜', '叛', '送', '类', '迷', '籽', '娄', '前', '首', '逆', '兹', '总', '炼', '炸', '烁', '炮', '炫', '烂', '剃', '洼', '洁', '洪', '洒', '槊', '浇', '浊', '洞', '测', '洗', '活', '派', '洽', '染', '洛', '浏', '济', '洋', '洲', '浑', '浓', '津', '恃', '恒', '恢', '恍', '恬', '恤', '恰', '恼', '恨', '举', '觉', '宣', '宦', '室', '宫', '宪', '突', '穿', '窃', '客', '诫', '冠', '诬', '语', '扁', '袄', '祖', '神', '祝', '祠', '误', '诱', '诲', '说', '诵', '垦', '退', '既', '屋', '昼', '屏', '屎', '费', '陡', '逊', '眉', '孩', '陨', '除', '险', '院', '娃', '姥', '姨', '姻', '娇', '姚', '娜', '怒', '架', '贺', '盈', '勇', '怠', '癸', '蚤', '柔', '垒', '绑', '绒', '结', '绕', '骄', '绘', '给', '绚', '骆', '络', '绝', '绞', '骇', '统', '耕', '耘', '耗', '耙', '艳', '泰', '秦', '珠', '班', '素', '匿', '蚕', '顽', '盏', '匪', '捞', '栽', '捕', '壇', '捂', '振', '载', '赶', '起', '盐', '捎', '捍', '捏', '埋', '捉', '捆', '捐', '损', '袁', '捌', '都', '哲', '逝', '捡', '挫', '换', '挽', '挚', '热', '恐', '捣', '壶', '捅', '埃', '挨', '耻', '耿', '耽', '聂', '恭', '莽', '莱', '莲', '莫', '莉', '荷', '获', '晋', '恶', '莹', '莺', '真', '框', '梆', '桂', '桔', '栖', '档', '桐', '株', '桥', '桦', '栓', '桃', '格', '桩', '校', '核', '样', '根', '索', '哥', '速', '逗', '栗', '贾', '酌', '配', '翅', '辱', '唇', '夏', '砸', '砰', '砾', '础', '破', '原', '套', '逐', '烈', '殊', '殉', '顾', '轿', '较', '顿', '毙', '致', '柴', '桌', '虑', '监', '紧', '党', '逞', '晒', '眠', '晓', '哮', '唠', '鸭', '晃', '哺', '晌', '剔', '晕', '蚌', '畔', '蚣', '蚊', '蚪', '蚓', '哨', '哩', '圃', '哭', '哦', '恩', '鸯', '唤', '唁', '哼', '唧', '啊', '唉', '唆', '罢', '峭', '峨', '峰', '圆', '峻', '贼', '贿', '赂', '赃', '钱', '钳', '钻', '钾', '铁', '铃', '铅', '缺', '氧', '氨', '特', '牺', '造', '乘', '敌', '秤', '租', '积', '秧', '秩', '称', '秘', '透', '笔', '笑', '笋', '债', '借', '值', '倚', '俺', '倾', '倒', '倘', '俱', '倡', '候', '赁', '俯', '倍', '倦', '健', '臭', '射', '躬', '息', '倔', '徒', '徐', '殷', '舰', '舱', '般', '航', '途', '拿', '耸', '爹', '舀', '爱', '豺', '豹', '颁', '颂', '翁', '胰', '脆', '脂', '胸', '胳', '脏', '脐', '胶', '脑', '脓', '逛', '狸', '狼', '卿', '逢', '鸵', '留', '鸳', '皱', '饿', '馁', '凌', '凄', '恋', '桨', '浆', '衰', '衷', '高', '郭', '席', '准', '座', '症', '病', '疾', '斋', '疹', '疼', '疲', '脊', '效', '离', '紊', '唐', '瓷', '资', '凉', '站', '剖', '竞', '部', '旁', '旅', '畜', '阅', '羞', '羔', '瓶', '拳', '粉', '料', '益', '兼', '烤', '烘', '烦', '烧', '烛', '烟', '烙', '递', '涛', '浙', '涝', '浦', '酒', '涉', '消', '涡', '浩', '海', '涂', '浴', '浮', '涣', '涤', '流', '润', '涧', '涕', '浪', '浸', '涨', '烫', '涩', '涌', '悖', '悟', '悄', '悍', '悔', '悯', '悦', '害', '宽', '家', '宵', '宴', '宾', '窍', '窄', '容', '宰', '案', '请', '朗', '诸', '诺', '读', '扇', '诽', '袜', '袖', '袍', '被', '祥', '课', '冥', '谁', '调', '冤', '谅', '谆', '谈', '谊', '剥', '恳', '展', '剧', '屑', '弱', '陵', '祟', '陶', '陷', '陪', '娱', '娟', '恕', '娥', '娘', '通', '能', '难', '预', '桑', '绢', '绣', '验', '继', '骏', '球', '琐', '理', '琉', '琅', '捧', '堵', '措', '描', '域', '捺', '掩', '捷', '排', '焉', '掉', '捶', '赦', '堆', '推', '埠', '掀', '授', '捻', '教', '掏', '掐', '掠', '掂', '培', '接', '掷', '控', '探', '据', '掘', '掺', '职', '基', '聆', '勘', '聊', '娶', '著', '菱', '勒', '黄', '菲', '萌', '萝', '菌', '萎', '菜', '萄', '菊', '菩', '萍', '菠', '萤', '营', '乾', '萧', '萨', '菇', '械', '彬', '梦', '婪', '梗', '梧', '梢', '梅', '检', '梳', '梯', '桶', '梭', '救', '曹', '副', '票', '酝', '酗', '厢', '戚', '硅', '硕', '奢', '盔', '爽', '聋', '袭', '盛', '匾', '雪', '辅', '辆', '颅', '虚', '彪', '雀', '堂', '常', '眶', '匙', '晨', '睁', '眯', '眼', '悬', '野', '啪', '啦', '曼', '晦', '晚', '啄', '啡', '距', '趾', '啃', '跃', '略', '蚯', '蛀', '蛇', '唬', '累', '鄂', '唱', '患', '啰', '唾', '唯', '啤', '啥', '啸', '崖', '崎', '崭', '逻', '崔', '帷', '崩', '崇', '崛', '婴', '圈', '铐', '铛', '铝', '铜', '铭', '铲', '银', '矫', '甜', '秸', '梨', '犁', '秽', '移', '笨', '笼', '笛', '笙', '符', '第', '敏', '做', '袋', '悠', '偿', '偶', '偎', '偷', '您', '售', '停', '偏', '躯', '兜', '假', '衅', '徘', '徙', '得', '衔', '盘', '舶', '船', '舵', '斜', '盒', '鸽', '敛', '悉', '欲', '彩', '领', '脚', '脖', '脯', '豚', '脸', '脱', '象', '够', '逸', '猜', '猪', '猎', '猫', '凰', '猖', '猛', '祭', '馅', '馆', '凑', '减', '毫', '烹', '庶', '麻', '庵', '痊', '痒', '痕', '廊', '康', '庸', '鹿', '盗', '章', '竟', '商', '族', '旋', '望', '率', '阎', '阐', '着', '羚', '盖', '眷', '粘', '粗', '粒', '断', '剪', '兽', '焊', '焕', '清', '添', '鸿', '淋', '涯', '淹', '渠', '渐', '淑', '淌', '混', '淮', '淆', '渊', '淫', '渔', '淘', '淳', '液', '淤', '淡', '淀', '深', '涮', '涵', '婆', '梁', '渗', '情', '惜', '惭', '悼', '惧', '惕', '惟', '惊', '惦', '悴', '惋', '惨', '惯', '寇', '寅', '寄', '寂', '宿', '窒', '窑', '密', '谋', '谍', '谎', '谐', '袱', '祷', '祸', '谓', '谚', '谜', '逮', '敢', '尉', '屠', '弹', '隋', '堕', '随', '蛋', '隅', '隆', '隐', '婚', '婶', '婉', '颇', '颈', '绩', '绪', '续', '骑', '绰', '绳', '维', '绵', '绷', '绸', '综', '绽', '绿', '缀', '巢', '琴', '琳', '琢', '琼', '斑', '替', '揍', '款', '堪', '塔', '搭', '堰', '揩', '越', '趁', '趋', '超', '揽', '堤', '提', '博', '揭', '喜', '彭', '揣', '插', '揪', '搜', '煮', '援', '搀', '裁', '搁', '搓', '搂', '搅', '壹', '握', '搔', '揉', '斯', '期', '欺', '联', '葫', '散', '惹', '葬', '募', '葛', '董', '葡', '敬', '葱', '蒋', '蒂', '落', '韩', '朝', '辜', '葵', '棒', '棱', '棋', '椰', '植', '森', '焚', '椅', '椒', '棵', '棍', '椎', '棉', '棚', '棕', '棺', '榔', '椭', '惠', '惑', '逼', '粟', '棘', '酣', '酥', '厨', '厦', '硬', '硝', '确', '硫', '雁', '殖', '裂', '雄', '颊', '雳', '暂', '雅', '翘', '辈', '悲', '紫', '凿', '辉', '敞', '棠', '赏', '掌', '晴', '睐', '暑', '最', '晰', '量', '鼎', '喷', '喳', '晶', '喇', '遇', '喊', '遏', '晾', '景', '畴', '践', '跋', '跌', '跑', '跛', '遗', '蛙', '蛛', '蜓', '蜒', '蛤', '喝', '鹃', '喂', '喘', '喉', '喻', '啼', '喧', '嵌', '幅', '帽', '赋', '赌', '赎', '赐', '赔', '黑', '铸', '铺', '链', '销', '锁', '锄', '锅', '锈', '锋', '锌', '锐', '甥', '掰', '短', '智', '氮', '毯', '氯', '鹅', '剩', '稍', '程', '稀', '税', '筐', '等', '筑', '策', '筛', '筒', '筏', '答', '筋', '筝', '傲', '傅', '牌', '堡', '集', '焦', '傍', '储', '皓', '皖', '粤', '奥', '街', '惩', '御', '循', '艇', '舒', '逾', '番', '释', '禽', '腊', '脾', '腋', '腔', '腕', '鲁', '猩', '猬', '猾', '猴', '惫', '然', '馈', '馋', '装', '蛮', '就', '敦', '斌', '痘', '痢', '痪', '痛', '童', '竣', '阔', '善', '翔', '羡', '普', '粪', '尊', '奠', '道', '遂', '曾', '焰', '港', '滞', '湖', '湘', '渣', '渤', '渺', '湿', '温', '渴', '溃', '溅', '滑', '湃', '渝', '湾', '渡', '游', '滋', '渲', '溉', '愤', '慌', '惰', '愕', '愣', '惶', '愧', '愉', '慨', '割', '寒', '富', '寓', '窜', '窝', '窖', '窗', '窘', '遍', '雇', '裕', '裤', '裙', '禅', '禄', '谢', '谣', '谤', '谦', '犀', '属', '屡', '强', '粥', '疏', '隔', '隙', '隘', '媒', '絮', '嫂', '媚', '婿', '登', '缅', '缆', '缉', '缎', '缓', '缔', '缕', '骗', '编', '骚', '缘', '瑟', '鹉', '瑞', '瑰', '瑙', '魂', '肆', '摄', '摸', '填', '搏', '塌', '鼓', '摆', '携', '搬', '摇', '搞', '塘', '摊', '聘', '斟', '蒜', '勤', '靴', '靶', '鹊', '蓝', '墓', '幕', '蓬', '蓄', '蒲', '蓉', '蒙', '蒸', '献', '椿', '禁', '楚', '楷', '榄', '想', '槐', '榆', '楼', '概', '赖', '酪', '酬', '感', '碍', '碘', '碑', '碎', '碰', '碗', '碌', '尴', '雷', '零', '雾', '雹', '辐', '辑', '输', '督', '频', '龄', '鉴', '睛', '睹', '睦', '瞄', '睫', '睡', '睬', '嗜', '鄙', '嗦', '愚', '暖', '盟', '歇', '暗', '暇', '照', '畸', '跨', '跷', '跳', '跺', '跪', '路', '跤', '跟', '遣', '螟', '蜗', '蛾', '蜂', '蜕', '嗅', '嗡', '嗓', '署', '置', '罪', '罩', '蜀', '幌', '错', '锚', '锡', '锣', '锤', '锥', '锦', '键', '锯', '镒', '矮', '辞', '稚', '稠', '颓', '愁', '筹', '签', '简', '筷', '毁', '舅', '鼠', '催', '傻', '像', '躲', '魁', '衙', '微', '愈', '遥', '腻', '腰', '腥', '腮', '腹', '腺', '鹏', '腾', '腿', '鲍', '猿', '颖', '触', '解', '煞', '雏', '馍', 'W', '酱', '禀', '痹', '廓', '痴', '痰', '廉', '靖', '新', '韵', '意', '誊', '粮', '数', '煎', '塑', '慈', '煤', '煌', '满', '漠', '滇', '源', '滤', '滥', '滔', '溪', '溜', '漓', '滚', '溢', '溯', '滨', '溶', '溺', '粱', '滩', '慎', '誉', '塞', '寞', '窥', '窟', '寝', '谨', '褂', '裸', '福', '谬', '群', '殿', '辟', '障', '媳', '嫉', '嫌', '嫁', '叠', '缚', '缝', '缠', '缤', '剿', '静', '碧', '璃', '赘', '熬', '墙', '墟', '嘉', '摧', '赫', '截', '誓', '境', '摘', '摔', '撇', '聚', '慕', '暮', '摹', '蔓', '蔑', '蔡', '蔗', '蔽', '蔼', '熙', '蔚', '兢', '模', '槛', '榴', '榜', '榨', '榕', '歌', '遭', '酵', '酷', '酿', '酸', '碟', '碱', '碳', '磁', '愿', '需', '辖', '辗', '雌', '裳', '颗', '瞅', '墅', '嗽', '踊', '蜻', '蜡', '蝇', '蜘', '蝉', '嘛', '嘀', '赚', '锹', '锻', '镀', '舞', '舔', '稳', '熏', '箕', '算', '箩', '管', '箫', '舆', '僚', '僧', '鼻', '魄', '魅', '貌', '膜', '膊', '膀', '鲜', '疑', '孵', '馒', '裹', '敲', '豪', '膏', '遮', '腐', '瘩', '瘟', '瘦', '辣', '彰', '竭', '端', '旗', '精', '粹', '歉', '弊', '熄', '熔', '煽', '潇', '漆', '漱', '漂', '漫', '滴', '漾', '演', '漏', '慢', '慷', '寨', '赛', '寡', '察', '蜜', '寥', '谭', '肇', '褐', '褪', '谱', '隧', '嫩', '翠', '熊', '凳', '骡', '缩', '慧', '撵', '撕', '撒', '撩', '趣', '趟', '撑', '撮', '撬', '播', '擒', '墩', '撞', '撤', '增', '撰', '聪', '鞋', '鞍', '蕉', '蕊', '蔬', '蕴', '横', '槽', '樱', '橡', '樟', '橄', '敷', '豌', '飘', '醋', '醇', '醉', '磕', '磊', '磅', '碾', '震', '霄', '霉', '瞒', '题', '暴', '瞎', '嘻', '嘶', '嘲', '嘹', '影', '踢', '踏', '踩', '踪', '蝶', '蝴', '蝠', '蝎', '蝌', '蝗', '蝙', '嘿', '嘱', '幢', '墨', '镇', '镐', '镑', '靠', '稽', '稻', '黎', '稿', '稼', '箱', '篓', '箭', '篇', '僵', '躺', '僻', '德', '艘', '膝', '膛', '鲤', '鲫', '熟', '摩', '褒', '瘪', '瘤', '瘫', '凛', '颜', '毅', '糊', '遵', '憋', '潜', '澎', '潮', '潭', '鲨', '澳', '潘', '澈', '澜', '澄', '懂', '憔', '懊', '憎', '额', '翩', '褥', '谴', '鹤', '憨', '慰', '劈', '履', '豫', '缭', '撼', '擂', '操', '擅', '燕', '蕾', '薯', '薛', '薇', '擎', '薪', '薄', '颠', '翰', '噩', '橱', '橙', '橘', '整', '融', '瓢', '醒', '霍', '霎', '辙', '冀', '餐', '嘴', '踱', '蹄', '蹂', '蟆', '螃', '器', '噪', '鹦', '赠', '默', '黔', '镜', '赞', '穆', '篮', '篡', '篷', '篱', '儒', '邀', '衡', '膨', '雕', '鲸', '磨', '瘾', '瘸', '凝', '辨', '辩', '糙', '糖', '糕', '燃', '濒', '澡', '激', '懒', '憾', '懈', '窿', '壁', '避', '缰', '缴', '戴', '擦', '藉', '鞠', '藏', '藐', '檬', '檐', '檀', '礁', '磷', '霜', '霞', '瞭', '瞧', '瞬', '瞳', '瞩', '瞪', '曙', '蹋', '蹈', '螺', '蟋', '蟀', '嚎', '赡', '穗', '魏', '簧', '簇', '繁', '徽', '爵', '朦', '臊', '鳄', '癌', '辫', '赢', '糟', '糠', '燥', '懦', '豁', '臀', '臂', '翼', '骤', '藕', '鞭', '藤', '覆', '瞻', '蹦', '嚣', '镰', '翻', '鳍', '鹰', '瀑', '襟', '璧', '戳', '孽', '警', '蘑', '藻', '攀', '曝', '蹲', '蹭', '蹬', '巅', '簸', '簿', '蟹', '颤', '靡', '癣', '瓣', '羹', '鳖', '爆', '疆', '鬓', '壤', '馨', '耀', '躁', '蠕', '嚼', '嚷', '巍', '籍', '鳞', '魔', '糯', '灌', '譬', '蠢', '霸', '露', '霹', '蹟', '黯', '髓', '赣', '囊', '镶', '瓤', '罐', '矗']

export function accountChars (account: string): ICharInfo[] {
  const splitter = new GraphemeSplitter()
  const split = splitter.splitGraphemes(account)
  const chars: ICharInfo[] = split.map((char) => {
    let _charType: number = CHAR_TYPE.notKnown
    if (emojiList.includes(char)) {
      _charType = CHAR_TYPE.emoji
    }
    else if (numberList.includes(char)) {
      _charType = CHAR_TYPE.number
    }
    else if (englishList.includes(char)) {
      _charType = CHAR_TYPE.english
    }
    else if (turkishList.includes(char)) {
      _charType = CHAR_TYPE.turkish
    }
    else if (vietnameseList.includes(char)) {
      _charType = CHAR_TYPE.vietnamese
    }
    else if (thaiList.includes(char)) {
      _charType = CHAR_TYPE.thai
    }
    else if (koreanList.includes(char)) {
      _charType = CHAR_TYPE.korean
    }

    return {
      char_set_name: _charType,
      char
    }
  })

  return chars
}

export function splitAccount (account: string, addSuffix = false): ICharInfo[] {
  const splitter = new GraphemeSplitter()
  const split = splitter.splitGraphemes(account)

  const englishSplitArr: ICharInfo[] = split.map((char: string) => {
    let _charType: number = CHAR_TYPE.notKnown
    if (emojiList.includes(char)) {
      _charType = CHAR_TYPE.emoji
    }
    else if (numberList.includes(char)) {
      _charType = CHAR_TYPE.number
    }
    else if (englishList.includes(char)) {
      _charType = CHAR_TYPE.english
    }

    return {
      char_set_name: _charType,
      char
    }
  })

  // const japaneseSplitArr: ICharInfo[] = split.map((char: string) => {
  //   let _charType: number = CHAR_TYPE.notKnown
  //   if (emojiList.includes(char)) {
  //     _charType = CHAR_TYPE.emoji
  //   }
  //   else if (numberList.includes(char)) {
  //     _charType = CHAR_TYPE.number
  //   }
  //   else if (japaneseList.includes(char)) {
  //     _charType = CHAR_TYPE.japanese
  //   }
  //
  //   return {
  //     char_set_name: _charType,
  //     char
  //   }
  // })

  // const russianSplitArr: ICharInfo[] = split.map((char: string) => {
  //   let _charType: number = CHAR_TYPE.notKnown
  //   if (emojiList.includes(char)) {
  //     _charType = CHAR_TYPE.emoji
  //   }
  //   else if (numberList.includes(char)) {
  //     _charType = CHAR_TYPE.number
  //   }
  //   else if (russianList.includes(char)) {
  //     _charType = CHAR_TYPE.russian
  //   }
  //
  //   return {
  //     char_set_name: _charType,
  //     char
  //   }
  // })

  const turkishSplitArr: ICharInfo[] = split.map((char: string) => {
    let _charType: number = CHAR_TYPE.notKnown
    if (emojiList.includes(char)) {
      _charType = CHAR_TYPE.emoji
    }
    else if (numberList.includes(char)) {
      _charType = CHAR_TYPE.number
    }
    else if (turkishList.includes(char)) {
      _charType = CHAR_TYPE.turkish
    }

    return {
      char_set_name: _charType,
      char
    }
  })

  const vietnameseSplitArr: ICharInfo[] = split.map((char: string) => {
    let _charType: number = CHAR_TYPE.notKnown
    if (emojiList.includes(char)) {
      _charType = CHAR_TYPE.emoji
    }
    else if (numberList.includes(char)) {
      _charType = CHAR_TYPE.number
    }
    else if (vietnameseList.includes(char)) {
      _charType = CHAR_TYPE.vietnamese
    }

    return {
      char_set_name: _charType,
      char
    }
  })

  const thaiSplitArr: ICharInfo[] = split.map((char: string) => {
    let _charType: number = CHAR_TYPE.notKnown
    if (emojiList.includes(char)) {
      _charType = CHAR_TYPE.emoji
    }
    else if (numberList.includes(char)) {
      _charType = CHAR_TYPE.number
    }
    else if (thaiList.includes(char)) {
      _charType = CHAR_TYPE.thai
    }

    return {
      char_set_name: _charType,
      char
    }
  })

  const koreanSplitArr: ICharInfo[] = split.map((char: string) => {
    let _charType: number = CHAR_TYPE.notKnown
    if (emojiList.includes(char)) {
      _charType = CHAR_TYPE.emoji
    }
    else if (numberList.includes(char)) {
      _charType = CHAR_TYPE.number
    }
    else if (koreanList.includes(char)) {
      _charType = CHAR_TYPE.korean
    }

    return {
      char_set_name: _charType,
      char
    }
  })

  // const simplifiedChineseSplitArr = split.map((char: string) => {
  //   let _charType: number = CHAR_TYPE.notKnown
  //   if (emojiList.includes(char)) {
  //     _charType = CHAR_TYPE.emoji
  //   }
  //   else if (numberList.includes(char)) {
  //     _charType = CHAR_TYPE.number
  //   }
  //   else if (simplifiedChineseList.includes(char)) {
  //     _charType = CHAR_TYPE.simplifiedChinese
  //   }
  //
  //   return {
  //     char_set_name: _charType,
  //     char
  //   }
  // })

  const englishNotKnownChar = englishSplitArr.find((item: ICharInfo) => {
    return item.char_set_name === CHAR_TYPE.notKnown
  })
  // const japaneseNotKnownChar = japaneseSplitArr.find((item: ICharInfo) => {
  //   return item.char_set_name === CHAR_TYPE.notKnown
  // })
  // const russianNotKnownChar = russianSplitArr.find((item: ICharInfo) => {
  //   return item.char_set_name === CHAR_TYPE.notKnown
  // })
  const turkishNotKnownChar = turkishSplitArr.find((item: ICharInfo) => {
    return item.char_set_name === CHAR_TYPE.notKnown
  })
  const vietnameseNotKnownChar = vietnameseSplitArr.find((item: ICharInfo) => {
    return item.char_set_name === CHAR_TYPE.notKnown
  })
  const thaiNotKnownChar = thaiSplitArr.find((item: ICharInfo) => {
    return item.char_set_name === CHAR_TYPE.notKnown
  })
  const koreanNotKnownChar = koreanSplitArr.find((item: ICharInfo) => {
    return item.char_set_name === CHAR_TYPE.notKnown
  })
  // const simplifiedChineseNotKnownChar = simplifiedChineseSplitArr.find((item: ICharInfo) => {
  //   return item.char_set_name === CHAR_TYPE.notKnown
  // })

  let splitArr = null

  if (!englishNotKnownChar) {
    splitArr = englishSplitArr
  }
  // else if (!japaneseNotKnownChar) {
  //   splitArr = japaneseSplitArr
  // }
  // else if (!russianNotKnownChar) {
  //   splitArr = russianSplitArr
  // }
  else if (!turkishNotKnownChar) {
    splitArr = turkishSplitArr
  }
  else if (!vietnameseNotKnownChar) {
    splitArr = vietnameseSplitArr
  }
  else if (!thaiNotKnownChar) {
    splitArr = thaiSplitArr
  }
  else if (!koreanNotKnownChar) {
    splitArr = koreanSplitArr
  }
  // else if (!simplifiedChineseNotKnownChar) {
  //   splitArr = simplifiedChineseSplitArr
  // }
  else {
    splitArr = split.map((char: string) => {
      return {
        char_set_name: CHAR_TYPE.notKnown,
        char
      }
    })
  }

  const notKnownChar = splitArr.find((item: ICharInfo) => {
    return item.char_set_name === CHAR_TYPE.notKnown
  })

  if (!notKnownChar) {
    const charList: { [key: string]: any } = {}
    if (!englishNotKnownChar) {
      charList.en = englishSplitArr
    }

    // if (!japaneseNotKnownChar) {
    //   charList.ja = japaneseSplitArr
    // }

    // if (!russianNotKnownChar) {
    //   charList.ru = russianSplitArr
    // }

    if (!turkishNotKnownChar) {
      charList.tr = turkishSplitArr
    }

    if (!vietnameseNotKnownChar) {
      charList.vi = vietnameseSplitArr
    }

    if (!thaiNotKnownChar) {
      charList.th = thaiSplitArr
    }

    if (!koreanNotKnownChar) {
      charList.ko = koreanSplitArr
    }

    let language = window.navigator.language
    if (/^en/i.test(language)) {
      language = 'en'
    }
    else if (/^ja/i.test(language)) {
      language = 'ja'
    }
    else if (/^ru/i.test(language)) {
      language = 'ru'
    }
    else if (/^tr/i.test(language)) {
      language = 'tr'
    }
    else if (/^vi/i.test(language)) {
      language = 'vi'
    }
    else if (/^th/i.test(language)) {
      language = 'th'
    }
    else if (/^ko/i.test(language)) {
      language = 'ko'
    }

    if (charList[language]) {
      splitArr = charList[language]
    }
    else if (charList.en) {
      splitArr = charList.en
    }
  }

  if (addSuffix) {
    ACCOUNT_SUFFIX.split('')
      .forEach((char: string) => {
        splitArr.push({
          char_set_name: CHAR_TYPE.english,
          char
        })
      })
  }

  return splitArr
}

/**
 * load script
 * @param src
 * @param id
 */
export function loadScript (src: string, id: string): Promise<any> {
  const script = 'script'
  const firstScript: HTMLScriptElement = document.getElementsByTagName(script)[0]
  if (document.getElementById(id)) {
    return Promise.resolve()
  }
  const scriptElement: HTMLScriptElement = document.createElement(script)
  scriptElement.id = id
  scriptElement.src = src
  firstScript.parentNode?.insertBefore(scriptElement, firstScript)

  return new Promise((resolve, reject) => {
    scriptElement.onload = resolve
    scriptElement.onerror = reject
  })
}

/**
 * get all user agent
 */
export function getAllUserAgent () {
  const ua: string = window.navigator.userAgent.toLowerCase()

  const wechat = ua.includes('micromessenger')
  const android = ua.includes('android')
  const ios = ua.includes('iphone')
  const ipados = ua.includes('ipad')

  return {
    // app user agent
    wechat,
    weibo: ua.includes('weibo'),
    mathwallet: ua.includes('mdsapp'),
    tokenpocket: ua.includes('tokenpocket'),
    // platform user agent
    android,
    ios,
    ipados,
    mobile: android || ios,
    windows: ua.includes('windows'),
    ubuntu: ua.includes('ubuntu'),
    mac: ua.includes('mac'),
    messenger: !wechat && (
      ua.includes('messenger') ||
      ua.includes('fbav') ||
      ua.includes('fban') ||
      window.location.href.includes('fb_iframe_origin')
    )
  }
}

/**
 * detects if the given user agent is supported
 * @param uaList
 */
export function isUASupported (uaList: string[]): boolean {
  const uaMap = getAllUserAgent()
  return uaList.some(ua => (uaMap as any)[ua])
}

/**
 * detect if the visitor is coming from mobile
 */
export function isMobileDevices (): boolean {
  return isUASupported(['wechat', 'android', 'ios'])
}

/**
 * check if the current access environment is a MathWallet environment
 */
export function isMathWallet (): boolean {
  return isUASupported(['mathwallet'])
}

/**
 * check if the current access environment is a TokenPocket environment
 */
export function isTokenPocket (): boolean {
  return isUASupported(['tokenpocket'])
}

/**
 * check if the current access environment is a Coinbase Wallet environment
 */
export function isCoinbaseWallet (): boolean {
  const { ethereum } = window
  if (typeof ethereum !== 'undefined') {
    return !!ethereum.isCoinbaseWallet
  }
  else {
    return false
  }
}

/**
 * check if the current access environment is a SafePal wallet environment
 */
export function isSafePalWallet (): boolean {
  const { ethereum } = window
  if (typeof ethereum !== 'undefined') {
    return !!ethereum.isSafePal
  }
  else {
    return false
  }
}

/**
 * check if the current access environment is a ViaWallet wallet environment
 */
export function isViaWallet (): boolean {
  const { ethereum } = window
  if (typeof ethereum !== 'undefined') {
    return !!ethereum.isViaWallet
  }
  else {
    return false
  }
}

/**
 * string initial capitalization
 * @param value
 */
export function capitalize (value: string): string {
  if (value) {
    return value.replace(/^\S/, s => s.toUpperCase())
  }
  else {
    return ''
  }
}

/**
 * get mmJson hash and chainId hex
 * @param typedData
 * @param chainId
 */
export function mmJsonHashAndChainIdHex (typedData: TypedMessage<any>, chainId: number): string {
  const mmHash = TypedDataUtils.eip712Hash(typedData, SignTypedDataVersion.V4).toString('hex')
  const chainIdHex = new BN(chainId).toString(16, 16)
  return mmHash + chainIdHex
}

export function fromSatoshi (satoshi: string | number): string {
  return shrinkUnit(satoshi, CKB.decimals, TOKEN_DECIMAL_PLACES)
}

/**
 * sleep for a fixed time
 * @param ms
 */
export function sleep (ms: number): Promise<void> {
  return new Promise(resolve => setTimeout(resolve, ms))
}

export function toDottedStyle (inputAccount: string): string {
  return Das.toDottedStyle(inputAccount)
}

export function toHashedStyle (inputAccount: string): string {
  // return Das.toHashedStyle(inputAccount)
  return inputAccount
}

export function nftTokenId (account: string): string {
  const personal = Buffer.from('ckb-default-hash')
  const accountBuf = Buffer.from(account)
  const hasher = blake2b(32, null, null, personal)
  hasher.update(accountBuf)
  const hashBuffer = hasher.digest('binary') as Uint8Array
  const first20Bytes = Buffer.from(hashBuffer.slice(0, 20))
  const tokenId = new BN(first20Bytes.toString('hex'), 16).toString(10)
  return tokenId
}

export function nftTokenIdHex (account: string): string {
  const personal = Buffer.from('ckb-default-hash')
  const accountBuf = Buffer.from(account)
  const hasher = blake2b(32, null, null, personal)
  hasher.update(accountBuf)
  const hashBuffer = hasher.digest('binary') as Uint8Array
  const first20Bytes = Buffer.from(hashBuffer.slice(0, 20))
  return '0x' + first20Bytes.toString('hex')
}
